export const fastFoods = [
    {
        "id": "fast001",
        "name": "西红柿炒鸡蛋",
        "ingrds0": [
            {
                "name": "西红柿",
                "amount": "2个"
            },
            {
                "name": "鸡蛋",
                "amount": "3个"
            },
        ],
        "ingreds1": [
            {
                "name": "葱",
                "amount": "葱花少许",
            },
        ],
        "prepDurInMin": 5,
        "prepSteps": [
            "西红柿划破外皮，在开水中烫一下，捞出后撕掉外皮，去蒂切成块",
            "鸡蛋加少许盐打散",
        ],
        "cookDurInMin": 3,
        "cookSteps": [
            "大火烧热锅，倒油，下蛋液，待起泡后用筷子拨散乘出待用",
            "葱花炝锅，倒入西红柿，快速翻炒，加入鸡蛋，盐，至西红柿断生即可出锅",
        ],
        "comments": "可以视个人口味或心情加酱油或糖",
        "utensil": "炒锅",
        "category": "热炒",
        "tags": ["快手菜", "血糖友好", "咀嚼省力", "微波炉友好"],
        "warning": [],
    },
];

/*
- 菜名
- 主料：名称，数量
- 辅料：名称，数量（万能的“适量”, ^-^）
- 准备时长：包含食材预处理，腌制，发酵等等
- 烹饪时长：实际操作时长
- 预处理步骤
- 操作步骤
- 厨具
- 标签：川菜，鲁菜，粤菜，异域料理，低脂，低糖，血糖友好，咀嚼省力，微波炉友好
- 分类：素菜，荤素，硬菜，凉菜，汤菜，适合季节
- 警告：宽油预警，油炸劝退，高辣危险，社交不友好/口气预警（葱蒜韭含量高），小众厨具（空气炸锅，三明治机），刀工劝退（豆腐丝，腰花），手残劝退（蛋饺，omelette），小众食材（特种奶酪，野生菌，罕见辅料或调料等等）
*/

