export const feast = [
    {
        'id': 'feast001',
        'name': '红烧肉',
        'ingrds0': [
            {
                'name': '五花肉',
                'amount': '1块',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜',
                'amount': '少许',
            },
            {
                'name': '花椒',
                'amount': '少许',
            },
            {
                'name': '八角桂皮等',
                'amount': '少许',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '猪皮在火上略烧去毛，切成寸方块，泡净血水',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '烧热锅，放白糖，慢火炒到糖液起大泡，下葱段，姜片，花椒，大料炒出香味',
            '下肉块翻炒到变色，倒大量料酒，生抽调味，老抽上色',
            '移到电饭锅里，加少量热水，放煮饭档煮熟',
        ],
        'comments': '也可以用炒锅直接煮，炒锅用来炖的时候水的消耗更大，需要的时间也更长',
        'utensil': '炒锅, 电饭锅',
        'category': '硬菜',
        'tags': [],
        'warnings': ['宽油预警'],
    },
];
/*
各种硬菜

烤肘子
水煮肉片

红烩牛肉
炖牛尾
双椒牛柳
川味红烧牛肉
干煸牛肉丝

烤羊排
烤羊腿
炒烤羊肉
蜜炙羊排
炖羊蝎子

炖鸡
烤鸡
大盘鸡
辣子鸡

清蒸鱼
红烧鱼
干烧鱼
水煮鱼
酸汤鱼
茄子烧鲶鱼
干煎带鱼
蜜汁烤带鱼
盐烤秋刀鱼
豆腐鱼火锅

白灼虾
红焖虾
椒盐烤虾

辣炒蛤蜊
蛤蜊豆腐汤
清蒸蛏子

鱼羊双鲜锅

饺子

白菜
香芹
黄心菜
玉米木耳

馄饨

三鲜
荠菜

火锅
清汤
番茄红汤
麻辣
鱼火锅

麻食

千层面
披萨
*/
