export const feast = [
    {
        'id': 'feast001',
        'name': '红烧肉',
        'ingrds0': [
            {
                'name': '五花肉',
                'amount': '1块',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜',
                'amount': '少许',
            },
            {
                'name': '花椒',
                'amount': '少许',
            },
            {
                'name': '八角桂皮等',
                'amount': '少许',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '猪皮在火上略烧去毛，切成寸方块，泡净血水',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '烧热锅，放白糖，慢火炒到糖液起大泡，下葱段，姜片，花椒，大料炒出香味',
            '下肉块翻炒到变色，倒大量料酒，生抽调味，老抽上色',
            '移到电饭锅里，加少量热水，放煮饭档煮熟',
        ],
        'comments': '也可以用炒锅直接煮，炒锅用来炖的时候水的消耗更大，需要的时间也更长',
        'utensil': '炒锅, 电饭锅',
        'category': '硬菜',
        'tags': [],
        'warnings': ['宽油预警'],
    },
    {
        'id': 'feast002',
        'name': '清炖鸡',
        'ingrds0': [
            {
                'name': '土鸡',
                'amount': '1只',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1根',
            },
            {
                'name': '生姜',
                'amount': '1块',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '土鸡剪去脚爪，飞水去腥',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '电饭锅底铺上葱姜，鸡全身用盐抹透，肚子里也塞上葱姜，放进电饭锅，放1杯黄酒或啤酒，开煮饭档',
            '等煮熟后拿出来，去掉葱姜，撕开蘸着吃，小料碟可以多备几个，比如椒盐、番茄酱、蒜蓉辣酱，各人喜欢什么口味自己选',
        ],
        'comments': '也可以用炖锅煮，炖锅蒸发量比电饭锅大，要稍微多放一些黄酒。一顿吃不完剩下的鸡架上的肉可以撕下来卷饼，拌面条，或者凉拌，剩下的骨头还可以再熬一次高汤',
        'utensil': '电饭锅',
        'category': '硬菜',
        'tags': [],
        'warnings': [''],
    },
    {
        'id': 'feast003',
        'name': '羊蝎子火锅',
        'ingrds0': [
            {
                'name': '羊蝎子',
                'amount': '1条',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜',
                'amount': '少许',
            },
            {
                'name': '干红辣椒',
                'amount': '少许',
            },
            {
                'name': '花椒',
                'amount': '少许',
            },
            {
                'name': '八角',
                'amount': '少许',
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '羊蝎子泡冷水，加葱姜烧开略煮，飞水去血沫',
        ],
        'cookDurInMin': 60,
        'cookSteps': [
            '烧热锅，放少量底油，姜片、葱段、花椒、辣椒、八角下锅炒香',
            '下羊肉，豆瓣酱，腐乳，料酒，生抽，番茄酱翻炒',
            '加水没过羊肉，大火煮开，改小火慢炖一小时',
            '移到火锅里上桌，涮各种食材',
        ],
        'comments': '可以用高压锅炖煮节省时间',
        'utensil': '炒锅, 电火锅',
        'category': '火锅',
        'tags': ['冬天'],
        'warnings': [],
    },
    {
        'id': 'feast004',
        'name': '豉汁蒸排骨',
        'ingrds0': [
            {
                'name': '猪肋排',
                'amount': '2斤',
            },
            {
                'name': '豆豉',
                'amount': '2大勺',
            },
            {
                'name': '生菜',
                'amount': '几片叶子',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜蒜末',
                'amount': '少许',
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '肋排剁成寸段，洗净血水，加盐、生抽、料酒、花椒粉腌入味',
        ],
        'cookDurInMin': 45,
        'cookSteps': [
            '烧热锅，放少量底油，下葱姜蒜末和豆豉炒香，加老抽、生抽、柱侯酱、盐、糖、少量水烧成豉汁',
            '排骨裹上生粉和豉汁拌匀，上笼大火蒸45分钟',
            '碗里垫洗净的生菜叶子，扣上蒸好的排骨，撒少许香葱末上桌',
        ],
        'comments': '可以用高压锅蒸节省时间',
        'utensil': '炒锅, 蒸锅',
        'category': '蒸菜',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'feast005',
        'name': '红烧牛肉',
        'ingrds0': [
            {
                'name': '牛腰窝肉',
                'amount': '2斤',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '2-3段',
            },
            {
                'name': '生姜',
                'amount': '1小块',
            },
            {
                'name': '花椒',
                'amount': '10颗左右',
            },
            {
                'name': '干红辣椒',
                'amount': '4-5个',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '牛腰窝肉或者筋肉巴脑的肉切寸方块，泡净血水',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '烧热锅，下葱段、姜片、花椒、辣椒、豆瓣酱、黄豆酱、番茄酱炒出香味',
            '下肉块翻炒到变色，倒半瓶啤酒或者大量料酒，加少量醋用来软化牛肉，生抽调味，老抽上色',
            '移到高压锅里，上汽后焖大概40分钟到牛肉软烂',
        ],
        'comments': '可以一次多做一些，之后加土豆胡萝卜烧成炖菜，或者用来拌面条都可以',
        'utensil': '炒锅, 高压锅',
        'category': '硬菜',
        'tags': [],
        'warnings': [''],
    },
    {
        'id': 'feast006',
        'name': '蒸蘑菇毛豆',
        'ingrds0': [
            {
                'name': '猪绞肉',
                'amount': '200克',
            },
            {
                'name': '荸荠',
                'amount': '100克',
            },
            {
                'name': '蟹味菇',
                'amount': '100克',
            },
            {
                'name': '白灵菇',
                'amount': '100克',
            },
            {
                'name': '毛豆',
                'amount': '100克',
            },
        ],
        'ingrds1': [
            {
                'name': '香葱',
                'amount': '2-3根',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '荸荠削皮切小丁',
            '猪绞肉加上少量姜末、一勺生抽、一勺蚝油、半勺白胡椒粉，半勺香油腌入味，加荸荠丁拌匀',
            '毛豆在盐水里煮10分钟左右入味',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '一只深碟，下面铺白灵菇和蟹味菇，上面摊一层腌好的荸荠肉馅，最上面铺上毛豆',
            '大火蒸10分钟左右，撒香葱末上桌',
        ],
        'comments': '调味不用太重，这样才更能体会蘑菇和毛豆自然的鲜甜味',
        'utensil': '蒸锅',
        'category': '蒸菜',
        'tags': ['春天'],
        'warnings': [''],
    },
    {
        'id': 'feast007',
        'name': '水煮肉片',
        'ingrds0': [
            {
                'name': '梅花肉',
                'amount': '200克',
            },
            {
                'name': '黄豆芽',
                'amount': '100克',
            },
            {
                'name': '豆腐皮',
                'amount': '100克',
            },
            {
                'name': '生菜',
                'amount': '100克',
            },
            {
                'name': '莴笋',
                'amount': '100克',
            },
        ],
        'ingrds1': [
            {
                'name': '香葱',
                'amount': '2-3根',
            },
            {
                'name': '姜末',
                'amount': '少量',
            },
            {
                'name': '蒜末',
                'amount': '少量',
            },
            {
                'name': '干红辣椒',
                'amount': '3-5个',
            },
            {
                'name': '花椒',
                'amount': '7-8个',
            },
        ],
        'prepDurInMin': 20,
        'prepSteps': [
            '梅花肉切薄片，加半勺盐、一勺生抽、一勺料酒、半勺花椒、一勺水淀粉抓匀',
            '豆芽摘掉帽子和老根，洗净，焯水，控干',
            '莴笋切丝',
            '豆腐皮切丝，焯水，控干',
            '生菜洗净撕小块，控干',
            '葱姜蒜切末',
            '干红辣椒和花椒在锅里慢火炒掉大部分水分，煸出香味，砸成辣椒花椒碎',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '用一只大碗，焯过水的蔬菜铺在碗底',
            '热锅凉油，下葱姜末和郫县豆瓣酱炒香，加一小碗或高汤，加盐、生抽、白糖、蚝油调味(如果有火锅底料的话也可以用一小块和葱姜末一起炒香)',
            '水烧开之后转中火，用筷子一片一片下肉片，到水再次微滚，关火，把肉和汤浇在铺好底菜的大碗里',
            '顶上铺蒜末、辣椒花椒碎，烧一点儿热油泼在上面',
        ],
        'comments': '底菜换成任何应季的蔬菜都可以，容易熟的绿叶菜直接用热汤烫熟就可以，不容易熟的比如豆腐丝黄豆芽之类事先焯水',
        'utensil': '炒锅',
        'category': '炒菜',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'feast008',
        'name': '沙茶牛肉煲',
        'ingrds0': [
            {
                'name': '肥牛片',
                'amount': '200克',
            },
            {
                'name': '豆腐',
                'amount': '200克',
            },
            {
                'name': '金针菇',
                'amount': '100克',
            },
        ],
        'ingrds1': [
            {
                'name': '香葱',
                'amount': '2-3根',
            },
            {
                'name': '姜末',
                'amount': '少量',
            },
            {
                'name': '蒜末',
                'amount': '少量',
            },
        ],
        'prepDurInMin': 20,
        'prepSteps': [
            '肥牛片加半勺盐、一勺生抽、一勺沙茶酱、一勺蚝油、一勺白糖、一勺水淀粉抓匀入味',
            '豆腐切厚片',
            '金针菇拦腰切段',
            '葱姜蒜切末',
            '半小碗水(100克左右)，加半勺盐、一勺生抽、一勺白糖、一勺蚝油、一勺沙茶酱调成味汁',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '锅里下少量底油，下豆腐煎到两面金黄，铲出备用',
            '小锅烧热，下姜蒜末炒香，铺上金针菇、煎好的豆腐片、肥牛片，浇上调好的味汁',
            '水烧开之后转小火，焖 5 分钟左右，撒少许香葱末上桌',
        ],
        'comments': '也可以在水开后在牛肉上面打一个鸡蛋，到鸡蛋还有点溏心的时候关火，划开鸡蛋用蛋黄和沙茶酱裹着牛肉享用',
        'utensil': '砂锅',
        'category': '炖菜',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'feast009',
        'name': '擂椒茄子皮蛋',
        'ingrds0': [
            {
                'name': '长条茄子',
                'amount': '1个',
            },
            {
                'name': '线椒',
                'amount': '5-6根',
            },
            {
                'name': '皮蛋',
                'amount': '1个',
            },
        ],
        'ingrds1': [
            {
                'name': '大蒜',
                'amount': '2-3瓣',
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '茄子对半剖开，上笼蒸10分钟，取出来晾凉，撕成筷子粗的条',
            '线椒洗净去蒂，中火慢煎到表面焦黄，放凉后撕掉外皮',
            '皮蛋切块',
            '蒜切粒',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '捣蒜钵里放入茄子、线椒、皮蛋、蒜末、半勺白糖、一勺醋、一勺生抽、一勺蚝油、半勺香油，用锤边捣边搅和均匀，移到小碗里上桌',
        ],
        'comments': '',
        'utensil': '蒸锅, 煎锅',
        'category': '凉菜',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'feast010',
        'name': '炒烤羊肉',
        'ingrds0': [
            {
                'name': '羊腿肉',
                'amount': '500克',
            },
            {
                'name': '大葱',
                'amount': '1根',
            },
            {
                'name': '洋葱',
                'amount': '几片',
            },
            {
                'name': '香菜',
                'amount': '200克',
            },
        ],
        'ingrds1': [
            {
                'name': '蒜',
                'amount': '1-2瓣',
            },
            {
                'name': '姜',
                'amount': '几片',
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '羊腿肉顶刀切成 1-2 mm 薄片',
            '大葱和洋葱切丝',
            '调腌肉汁：起锅烧葱油，润锅后倒出，锅中留底油，倒入90g酱油，5g花椒，1g胡椒粉，2g桂皮，3g孜然，20g料酒，开锅后小火熬2分钟左右倒出晾凉',
            '肉中倒入70g腌肉汁搅拌均匀，倒入姜蒜水20g搅拌均匀，加入大葱，洋葱丝，香油搅拌均匀后腌制3分钟',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '起锅烧葱油至冒烟后倒出，锅中留底油，放入一半腌好的肉，把肉扒拉开摊平，出汤后把肉扒拉到锅边，中间的汤熬干（汤太多可舀出），肉表面出焦糖色后放入一半大葱，香菜翻炒均匀，出锅',
            '再起锅炒第二锅。家里的火比饭店的明火小，为了炒出类似炙子烤肉的效果，一次最多炒半斤',
        ],
        'comments': '',
        'utensil': '炒锅',
        'category': '炒菜',
        'tags': ['秋天', '冬天'],
        'warnings': [''],
    },
];
/*
各种硬菜

烤肘子
粉蒸肉

红烩牛肉
炖牛尾
双椒牛柳
川味红烧牛肉
干煸牛肉丝

烤羊排
烤羊腿
炒烤羊肉
蜜炙羊排
炖羊蝎子
马帮羊里脊
盐焗羊肝

炖鸡
烤鸡
大盘鸡
辣子鸡

清蒸鱼
红烧鱼
干烧鱼
水煮鱼
酸汤鱼
茄子烧鲶鱼
干煎带鱼
蜜汁烤带鱼
盐烤秋刀鱼
豆腐鱼火锅

白灼虾
红焖虾
椒盐烤虾

辣炒蛤蜊
蛤蜊豆腐汤
清蒸蛏子

鱼羊双鲜锅

饺子

白菜
香芹
黄心菜
玉米木耳

馄饨

三鲜
荠菜

火锅
清汤
番茄红汤
麻辣
鱼火锅

麻食

千层面
披萨
*/
