export const feast = [
    {
        'id': 'feast001',
        'name': '红烧肉',
        'ingrds0': [
            {
                'name': '五花肉',
                'amount': '1块',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜',
                'amount': '少许',
            },
            {
                'name': '花椒',
                'amount': '少许',
            },
            {
                'name': '八角桂皮等',
                'amount': '少许',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '猪皮在火上略烧去毛，切成寸方块，泡净血水',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '烧热锅，放白糖，慢火炒到糖液起大泡，下葱段，姜片，花椒，大料炒出香味',
            '下肉块翻炒到变色，倒大量料酒，生抽调味，老抽上色',
            '移到电饭锅里，加少量热水，放煮饭档煮熟',
        ],
        'comments': '也可以用炒锅直接煮，炒锅用来炖的时候水的消耗更大，需要的时间也更长',
        'utensil': '炒锅, 电饭锅',
        'category': '硬菜',
        'tags': [],
        'warnings': ['宽油预警'],
    },
    {
        'id': 'feast002',
        'name': '清炖鸡',
        'ingrds0': [
            {
                'name': '土鸡',
                'amount': '1只',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1根',
            },
            {
                'name': '生姜',
                'amount': '1块',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '土鸡剪去脚爪，飞水去腥',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '电饭锅底铺上葱姜，鸡全身用盐抹透，肚子里也塞上葱姜，放进电饭锅，放1杯黄酒或啤酒，开煮饭档',
            '等煮熟后拿出来，去掉葱姜，撕开蘸着吃，小料碟可以多备几个，比如椒盐、番茄酱、蒜蓉辣酱，各人喜欢什么口味自己选',
        ],
        'comments': '也可以用炖锅煮，炖锅蒸发量比电饭锅大，要稍微多放一些黄酒。一顿吃不完剩下的鸡架上的肉可以撕下来卷饼，拌面条，或者凉拌，剩下的骨头还可以再熬一次高汤',
        'utensil': '电饭锅',
        'category': '硬菜',
        'tags': [],
        'warnings': [''],
    },
    {
        'id': 'feast003',
        'name': '羊蝎子火锅',
        'ingrds0': [
            {
                'name': '羊蝎子',
                'amount': '1条',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜',
                'amount': '少许',
            },
            {
                'name': '干红辣椒',
                'amount': '少许',
            },
            {
                'name': '花椒',
                'amount': '少许',
            },
            {
                'name': '八角',
                'amount': '少许',
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '羊蝎子泡冷水，加葱姜烧开略煮，飞水去血沫',
        ],
        'cookDurInMin': 60,
        'cookSteps': [
            '烧热锅，放少量底油，姜片、葱段、花椒、辣椒、八角下锅炒香',
            '下羊肉，豆瓣酱，腐乳，料酒，生抽，番茄酱翻炒',
            '加水没过羊肉，大火煮开，改小火慢炖一小时',
            '移到火锅里上桌，涮各种食材',
        ],
        'comments': '可以用高压锅炖煮节省时间',
        'utensil': '炒锅, 电火锅',
        'category': '火锅',
        'tags': ['冬天'],
        'warnings': [],
    },
    {
        'id': 'feast004',
        'name': '豉汁蒸排骨',
        'ingrds0': [
            {
                'name': '猪肋排',
                'amount': '2斤',
            },
            {
                'name': '豆豉',
                'amount': '2大勺',
            },
            {
                'name': '生菜',
                'amount': '几片叶子',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜蒜末',
                'amount': '少许',
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '肋排剁成寸段，洗净血水，加盐、生抽、料酒、花椒粉腌入味',
        ],
        'cookDurInMin': 45,
        'cookSteps': [
            '烧热锅，放少量底油，下葱姜蒜末和豆豉炒香，加老抽、生抽、柱侯酱、盐、糖、少量水烧成豉汁',
            '排骨裹上生粉和豉汁拌匀，上笼大火蒸45分钟',
            '碗里垫洗净的生菜叶子，扣上蒸好的排骨，撒少许香葱末上桌',
        ],
        'comments': '可以用高压锅蒸节省时间',
        'utensil': '炒锅, 蒸锅',
        'category': '蒸菜',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'feast005',
        'name': '红烧牛肉',
        'ingrds0': [
            {
                'name': '牛腰窝肉',
                'amount': '2斤',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '2-3段',
            },
            {
                'name': '生姜',
                'amount': '1小块',
            },
            {
                'name': '花椒',
                'amount': '10颗左右',
            },
            {
                'name': '干红辣椒',
                'amount': '4-5个',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '牛腰窝肉或者筋肉巴脑的肉切寸方块，泡净血水',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '烧热锅，下葱段、姜片、花椒、辣椒、豆瓣酱、黄豆酱、番茄酱炒出香味',
            '下肉块翻炒到变色，倒半瓶啤酒或者大量料酒，加少量醋用来软化牛肉，生抽调味，老抽上色',
            '移到高压锅里，上汽后焖大概40分钟到牛肉软烂',
        ],
        'comments': '可以一次多做一些，之后加土豆胡萝卜烧成炖菜，或者用来拌面条都可以',
        'utensil': '炒锅, 高压锅',
        'category': '硬菜',
        'tags': [],
        'warnings': [''],
    },
];
/*
各种硬菜

烤肘子
水煮肉片
粉蒸肉

红烩牛肉
炖牛尾
双椒牛柳
川味红烧牛肉
干煸牛肉丝

烤羊排
烤羊腿
炒烤羊肉
蜜炙羊排
炖羊蝎子

炖鸡
烤鸡
大盘鸡
辣子鸡

清蒸鱼
红烧鱼
干烧鱼
水煮鱼
酸汤鱼
茄子烧鲶鱼
干煎带鱼
蜜汁烤带鱼
盐烤秋刀鱼
豆腐鱼火锅

白灼虾
红焖虾
椒盐烤虾

辣炒蛤蜊
蛤蜊豆腐汤
清蒸蛏子

鱼羊双鲜锅

饺子

白菜
香芹
黄心菜
玉米木耳

馄饨

三鲜
荠菜

火锅
清汤
番茄红汤
麻辣
鱼火锅

麻食

千层面
披萨
*/
