/*
面条

炸酱面
杂酱面
茄汁肉酱面
臊子面
香菇肉末面
茄丁面
炒菜面
麻酱凉面
担担面
青椒肉丝面
酸汤羊肉面
红烧牛肉面

面片

小白菜揪面片
山野面片（韭菜豆腐木耳肉片）

米粉

三鲜米粉
炒米粉

米线

牛肉米线

意面

长圆面 spagheltti 8-10 min
蝴蝶面 farferlle 10-12 m
天使细面 capellini 5-8 m
贝壳面 conchiglie 8-10 m
笔管面 penne 8-10 m
宽扁面 fettuccine 8-10 m
螺旋面 fusilli 8-10 m
千层面 lasagne 5-7 m

红酱
西红柿去皮切块
洋葱碎
蒜末
综合香草 （欧芹 罗勒 迷迭香 香草粉）
黄油融化，加洋葱碎和蒜末炒出香味
加西红柿块炒成糊状
加综合香草，黑胡椒，番茄酱，盐，收汁

茄汁肉酱
牛肉碎加盐腌 5 分钟
橄榄油烧热，加蒜末，洋葱碎，去皮番茄丁，胡萝卜丁翻炒
加入牛肉碎，番茄酱，盐，黑胡椒，比萨草，炒至酱汁收稠

红酱可以和牛排，猪排，牛肉丸，火腿，炸鸡柳等肉类，
西兰花，胡萝卜，杏鲍菇，香菇，袖珍菇，洋葱，芦笋，茄子，西葫芦，炸土豆，豆角，莴笋等蔬菜随意组合搭配

千层面
烤盘或锡纸刷油，铺熟面片，茄汁肉酱，马苏里拉奶酪丝，重复三层，180度烤20分钟

白酱
适合各种海鲜
鲜虾，干贝，花蛤，金枪鱼，鱿鱼，墨鱼

黄油35克
洋葱末40克
低筋面粉20克
淡奶油80克
高汤60克
盐3克
黑胡椒1/8小勺
白葡萄酒5毫升

黄油融化，加洋葱末炒出香味，加入面粉炒匀
加入淡奶油和高汤，搅拌均匀，加入盐，黑胡椒调味
待酱汁浓稠，加入白葡萄酒搅拌均匀关火

配西兰花，白菜花，油菜花，杏鲍菇，香菇，蟹味菇，芦笋，培根等

青酱
适合各种凉拌

橄榄油
熟松子仁
西芹叶，罗勒叶
盐
黑胡椒粉
帕玛森奶酪
蒜末
水
放入搅拌机搅匀即可

配口蘑，甜椒，洋葱，紫甘蓝，黄瓜，牛奶菠菜泥，玉米粒，火腿，鸡肉，三文鱼，鳕鱼

*/
