export const noodle = [
    {
        'id': 'noodle001',
        'name': '手擀面',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '水',
                'amount': '190克',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
        ],
        'ingrds1': [
            {
                'name': '细玉米面(薄面)',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '中筋粉和水，比 2:1 略少一点儿，加一小勺盐，和成面团，饧30分钟以上',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '饧好的面团移到案板上，使劲揉到光滑',
            '用擀面杖擀成1毫米左右厚的大薄片，如果案板不够大，分成两个面团各自擀成薄片也可以，注意厚薄要均匀',
            '在面片上撒薄面，折叠起来，用刀切成韭叶宽的面条',
            '烧一锅水，水里放一勺盐，滚水下锅，控制火力保持微滚，煮3分钟左右即可捞出，可以随意搭配喜欢的浇头',
        ],
        'comments': '水越少，面越硬，和成面团以后可以包保鲜膜放冰箱冷藏4小时以上再揉，会比较容易揉',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle002',
        'name': '鸡蛋面',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '水',
                'amount': '150克',
            },
            {
                'name': '鸡蛋',
                'amount': '1个(约50克)',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
        ],
        'ingrds1': [
            {
                'name': '细玉米面(薄面)',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '中筋粉，加蛋和水，加一小勺盐，和成面团，饧30分钟以上',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '饧好的面团移到案板上，使劲揉到光滑',
            '用擀面杖擀成1毫米左右厚的大薄片，如果案板不够大，分成两个面团各自擀成薄片也可以，注意厚薄要均匀',
            '在面片上撒薄面，折叠起来，用刀切成韭叶宽的面条',
            '烧一锅水，水里放一勺盐，滚水下锅，控制火力保持微滚，煮3分钟左右即可捞出，可以随意搭配喜欢的浇头',
        ],
        'comments': '普通饭量100克面条大概够七寸碗的一碗，长身体的小孩可以下150克，饭量小的或者晚上可以下50克',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle003',
        'name': '炸酱面',
        'ingrds0': [
            {
                'name': '猪绞肉(三肥七瘦)',
                'amount': '500克',
            },
            {
                'name': '干黄酱',
                'amount': '50克',
            },
            {
                'name': '甜面酱',
                'amount': '50克',
            },
            {
                'name': '大葱',
                'amount': '1根',
            },
            {
                'name': '黄瓜',
                'amount': '1根',
            },
        ],
        'ingrds1': [
            {
                'name': '姜末',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '干黄酱用水澥开',
            '葱姜切末',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '烧热锅，下少量底油，下猪绞肉炒散，加姜末，烹料酒去腥，慢火煸出油',
            '把肉末拨开，在中间煸出的油里下干黄酱和甜面酱炒香，下葱末炸香，注意控制火力不要糊',
            '煮手擀面或者机器切面，铺上黄瓜丝，浇上炸酱',
        ],
        'comments': '也可以配胡萝卜丝，烫熟的绿豆芽，咸萝卜丁，煮黄豆，大蒜等各种菜码',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle004',
        'name': '杂酱面',
        'ingrds0': [
            {
                'name': '猪肉(三肥七瘦)',
                'amount': '500克',
            },
            {
                'name': '黄豆酱',
                'amount': '50克',
            },
            {
                'name': '甜面酱',
                'amount': '50克',
            },
            {
                'name': '芝麻花生酱',
                'amount': '50克',
            },
            {
                'name': '大葱',
                'amount': '1根',
            },
            {
                'name': '黄瓜',
                'amount': '1根',
            },
        ],
        'ingrds1': [
            {
                'name': '姜末',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '猪肉去皮，分开肥瘦，切成小丁',
            '芝麻花生酱加水澥开',
            '葱姜切末',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '烧热锅，下少量底油，下肥肉丁，慢慢煸出猪油',
            '在煸出的油里下黄豆酱、甜面酱、芝麻花生酱炒香',
            '下瘦肉炒散，加姜末，烹料酒去腥，加一点儿水，慢火熬一会儿',
            '煮手擀面或者机器切面，铺上黄瓜丝，浇上炸酱',
        ],
        'comments': '炸酱可以一次多熬一点儿，除了拌面条，夹在馒头里吃也很香',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle005',
        'name': '番茄肉酱面',
        'ingrds0': [
            {
                'name': '猪绞肉(三肥七瘦)',
                'amount': '250克',
            },
            {
                'name': '西红柿',
                'amount': '2个',
            },
            {
                'name': '番茄酱',
                'amount': '2大勺',
            },
            {
                'name': '洋葱',
                'amount': '几片',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 5,
        'prepSteps': [
            '西红柿划十字刀，在开水里烫一分钟，捞出撕掉外皮，去蒂切丁',
            '洋葱切末',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '烧热锅，下少量底油，下洋葱末和猪绞肉炒散，加盐、生抽、料酒调味',
            '下西红柿丁和西红柿酱，慢火熬煮到酱汁浓稠',
            '煮手擀面或者机器切面，浇上番茄肉酱',
        ],
        'comments': '这里的番茄酱是新疆产的罐头，不是加了一堆配料的番茄沙司',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle006',
        'name': '臊子面',
        'ingrds0': [
            {
                'name': '猪绞肉(三肥七瘦)',
                'amount': '250克',
            },
            {
                'name': '西红柿',
                'amount': '2个',
            },
            {
                'name': '土豆',
                'amount': '1个',
            },
            {
                'name': '木耳',
                'amount': '适量',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '木耳用水泡发，去老根，撕成小片',
            '西红柿划十字刀，在开水里烫一分钟，捞出撕掉外皮，去蒂切丁',
            '土豆削皮切丁',
            '大葱切末',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '烧热锅，下少量底油，葱花炝锅，下猪绞肉炒散，加盐、生抽、料酒调味',
            '下西红柿丁、土豆丁和木耳，加小半碗水，烧开后中小火熬煮到土豆炖烂，酱汁浓稠',
            '煮手擀面或者机器切面，浇上臊子',
        ],
        'comments': '木耳也可以换成香菇丁，也可以加黄花菜，胡萝卜丁，莴笋丁或豆腐丁',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle007',
        'name': '香菇肉丝面',
        'ingrds0': [
            {
                'name': '猪肉(三肥七瘦)',
                'amount': '250克',
            },
            {
                'name': '香菇',
                'amount': '250克',
            },
            {
                'name': '油菜',
                'amount': '2-3颗',
                'optional': true,
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '生姜',
                'amount': '几片',
            },
            {
                'name': '香葱',
                'amount': '1小根',
                'optional': true,
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '猪肉去皮，肥瘦分开，肥肉切丁，瘦肉切丝',
            '香菇切片',
            '油菜掰开叶子，洗净控干',
            '葱姜切末',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '烧热锅，下少量底油，下肥肉丁慢火煸出油',
            '在煸出来的油里滑散瘦肉丝，到肉丝变色，下葱姜末、盐、生抽、料酒调味',
            '下香菇丝翻炒，加小半碗水，烧开后中小火熬煮到汤汁浓稠',
            '煮手擀面或者机器切面，面条快煮好的时候下油菜烫熟',
            '现捞油菜铺在碗底，再捞面条，最后浇上炒好的香菇肉丝',
            '可以按个人口味撒上香葱末或油泼辣子',
        ],
        'comments': '油菜也可以换成任意绿叶菜',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle008',
        'name': '茄丁面',
        'ingrds0': [
            {
                'name': '圆茄子',
                'amount': '1个',
            },
            {
                'name': '肉臊子',
                'amount': '适量',
                'link': 'prck003',
                'optional': true,
            },
        ],
        'ingrds1': [
            {
                'name': '大蒜',
                'amount': '3-4瓣',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '茄子去蒂切丁，用盐腌半小时左右，攥出多余水分',
            '大蒜去皮切粒',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '烧热锅，倒稍微多一些油，有荤油更好',
            '下茄丁煸炒，如果有肉臊子可以加点儿，加一点儿水稍焖一会儿',
            '到茄丁软熟的时候加蒜粒，加一勺黄豆酱，少量盐和花椒粉调味',
            '煮手擀面或者机器切面',
            '浇上炒好的茄丁',
        ],
        'comments': '怕生蒜味道的同学可以先放蒜粒，让它完全熟透；喜欢重口味的同学可以最后放蒜粒或者自己就生蒜吃',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': ['口气预警'],
    },
    {
        'id': 'noodle009',
        'name': '炒菜面',
        'ingrds0': [
            {
                'name': '圆白菜',
                'amount': '半个',
            },
            {
                'name': '青椒',
                'amount': '1只',
            },
            {
                'name': '洋葱',
                'amount': '几片',
            },
            {
                'name': '炒肉片',
                'amount': '适量',
                'link': 'prck004',
                'optional': true,
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '圆白菜去硬心去老梗，切成丝',
            '青椒去蒂去籽切丝',
            '洋葱切丝',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '热锅凉油，下洋葱丝炒香',
            '下圆白菜丝，青椒丝炒到断生，加盐、生抽、花椒粉调味',
            '如果有炒肉片或者炒肉丝可以加点儿，盖锅略焖一会儿到圆白菜软熟',
            '煮手擀面或者机器切面',
            '浇上炒好的菜',
        ],
        'comments': '各种带汤汁的炒菜都可以拿来拌面条',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle010',
        'name': '麻酱凉面',
        'ingrds0': [
            {
                'name': '黄瓜',
                'amount': '1根',
            },
            {
                'name': '绿豆芽',
                'amount': '1把',
            },
        ],
        'ingrds1': [
            {
                'name': '芝麻花生酱',
                'amount': '几根',
            },
            {
                'name': '萝卜干',
                'amount': '几根',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '黄瓜切丝',
            '绿豆芽摘掉帽子和过长的须根',
            '萝卜干切丁',
            '芝麻花生酱加生抽和水澥开',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '煮手擀面或者机器切面',
            '绿豆芽焯水，和黄瓜丝、萝卜干一起铺在碗底',
            '煮好的面条过凉水，控干捞进碗里',
            '浇上澥开的芝麻花生酱',
        ],
        'comments': '可以按个人口味加蒜泥或油泼辣子',
        'utensil': '煮锅',
        'category': '主食',
        'tags': ['夏天'],
        'warnings': [''],
    },
    {
        'id': 'noodle011',
        'name': '担担面',
        'ingrds0': [
            {
                'name': '猪绞肉',
                'amount': '250克',
            },
            {
                'name': '碎米芽菜',
                'amount': '1包(100克)',
            },
            {
                'name': '豌豆尖',
                'amount': '1把',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜蒜末',
                'amount': '适量',
            },
            {
                'name': '干红辣椒',
                'amount': '3-5个',
            },
            {
                'name': '芝麻酱',
                'amount': '1勺',
            },
            {
                'name': '熟花生',
                'amount': '1把',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '豌豆尖洗净控干',
            '葱一段，姜几片，蒜两三瓣，都切成末',
            '干红辣椒去蒂去籽剪段',
            '芝麻酱加生抽和水澥开',
            '熟花生放在保鲜袋里，用擀面杖擀成花生碎',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '葱姜蒜末干红辣椒炝锅，下猪肉末炒散，慢火煸出油',
            '下碎米芽菜炒香，加澥开的芝麻酱，生抽老抽调味上色，加一点儿水或高汤熬一会儿',
            '煮手擀面或者机器切面',
            '豌豆尖焯水铺在碗底，捞进面条，浇上炒好的酱，撒上花生碎',
        ],
        'comments': '吃的时候可以按个人口味加醋，红油或者香葱末；没有豌豆尖的话可以用其他青菜叶子代替；买来的碎米芽菜有时候很咸，最好先尝一下，如果太咸的话可以用水泡一下去掉多余盐分',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle012',
        'name': '青椒肉丝面',
        'ingrds0': [
            {
                'name': '青椒',
                'amount': '2-3个',
            },
            {
                'name': '瘦肉',
                'amount': '200克',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '瘦肉切丝，加盐、生抽、料酒、花椒粉抓匀入味，腌20分钟左右',
            '青椒去蒂去籽切丝',
            '大葱切末',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '热锅凉油，下瘦肉丝滑散',
            '到肉丝变色，加葱花、青椒翻炒青椒丝炒到断生，加盐、生抽、花椒粉调味',
            '煮手擀面或者机器切面',
            '浇上炒好的菜',
        ],
        'comments': '',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle013',
        'name': '酸汤羊肉面',
        'ingrds0': [
            {
                'name': '清炖羊肉',
                'amount': '1块',
                'link': 'prck011',
            },
            {
                'name': '金针菇',
                'amount': '半把',
            },
            {
                'name': '豆腐皮',
                'amount': '1张',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '泡姜',
                'amount': '1块',
            },
            {
                'name': '泡椒',
                'amount': '4-5根',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '熟羊肉切厚片',
            '金针菇切掉老根切成段',
            '豆腐皮切细丝泡水去豆腥味',
            '大葱切丝',
            '泡姜切细丝',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '热锅凉油，下葱丝、泡姜丝、泡椒爆锅',
            '下金针菇炒软',
            '倒一小碗高汤水或水，下豆腐丝、羊肉片煮开，转小火略炖',
            '加泡菜汁、醋、盐、生抽、白胡椒调味',
            '煮细挂面或者细米粉',
            '浇上炒好的菜',
        ],
        'comments': '除了金针菇，加其他蘑菇比如滑子菇、白灵菇、香菇也可以；如果没有炖好的羊肉块，用冻羊肉片也可以；如果没有泡椒和泡姜，用金汤酱也可以',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle014',
        'name': '红烧牛肉面',
        'ingrds0': [
            {
                'name': '红烧牛肉',
                'amount': '适量',
                'link': 'feast005',
            },
            {
                'name': '油菜',
                'amount': '半把',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 5,
        'prepSteps': [
            '油菜掰开叶子，洗净控干',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '事先煮好的红烧牛肉在炒锅里连菜带汤热一下，如果想要多汁的话，可以适量再加一只番茄切丁和少量番茄酱烧一下',
            '煮手擀面或者机器切面',
            '面条快熟的时候，下油菜烫熟',
            '碗里铺上油菜，捞上面条，浇上炒好的菜',
        ],
        'comments': '自己家做的红烧牛肉面，主打一个豪横，牛肉可以多多地放，还可以加个卤蛋',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle015',
        'name': '黄瓜鸡蛋面',
        'ingrds0': [
            {
                'name': '黄瓜',
                'amount': '1根',
            },
            {
                'name': '鸡蛋',
                'amount': '2个',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '黄瓜洗净，斜切成丝',
            '鸡蛋加小半勺盐打散',
            '大葱切末',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '热锅凉油，下蛋液煎成蛋饼，用铲子铲成细条，铲出待用',
            '葱花炝锅，下两碗水烧开，加一勺盐，下一把细挂面',
            '煮5分钟左右，面条快熟的时候，下黄瓜和鸡蛋',
            '最后可以按个人口味，加胡椒和几滴香油出锅',
        ],
        'comments': '如果家里有虾皮或者蛤蜊干也可以放一点儿；非常清爽的小面条，晚上下班回家15分钟之内就能做好，大冷天儿里的一碗热汤面，最能抚慰身心；这个量是两到三人份的，如果是一个人吃半根黄瓜一个蛋就可以了',
        'utensil': '炒锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle016',
        'name': '丝瓜汤面',
        'ingrds0': [
            {
                'name': '丝瓜',
                'amount': '1根',
            },
            {
                'name': '虾米',
                'amount': '1把',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '大蒜',
                'amount': '2-3瓣',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '丝瓜削皮，斜切成滚刀块',
            '葱蒜切粒',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '热锅凉油，下葱蒜粒炝锅，下丝瓜略炒到出水',
            '锅里下两碗水烧开，下虾米，加一勺盐，下一把细挂面',
            '面片煮熟后，加胡椒和几滴香油出锅',
        ],
        'comments': '虾米也可以替换成虾皮，蛤蜊干或者小银鱼',
        'utensil': '炒锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle017',
        'name': '白菜鱼丸面',
        'ingrds0': [
            {
                'name': '大白菜',
                'amount': '几片叶子',
            },
            {
                'name': '鱼丸',
                'amount': '6-7个',
            },
            {
                'name': '鲜切面',
                'amount': '1把',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '鱼丸切开',
            '白菜掰成小块',
            '葱切粒',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '热锅凉油，下葱粒炝锅，下白菜帮子略炒到出水',
            '锅里下两碗水烧开，加一勺盐，下鱼丸，下粗面，鱼丸煮胖了之后下白菜叶子',
            '面条煮熟后，加胡椒和几滴香油出锅',
        ],
        'comments': '有鱼丸，也有粗面^-^',
        'utensil': '炒锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle018',
        'name': '小白菜揪面片',
        'ingrds0': [
            {
                'name': '小白菜',
                'amount': '1把',
            },
            {
                'name': '虾米',
                'amount': '1把',
            },
            {
                'name': '面粉',
                'amount': '200克',
            }
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '200克面粉加100克水，和成面团，饧30分钟左右，面板上涂油，面团揉光之后擀成面饼，切成手指粗的条，用掌根压成宽1寸左右的宽条',
            '小白菜去根和老叶，洗净控干，揪成手指长的段',
            '葱切粒',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '热锅凉油，下葱蒜粒虾米炝锅',
            '锅里下两碗水烧开，加一勺盐，面板上的宽面条一边抻一边揪成手指长的面片下到热汤里',
            '面片下完之后，下小白菜煮熟，加胡椒和几滴香油出锅',
        ],
        'comments': '换成其他绿叶菜比如菠菜、黄心菜、地瓜叶揪面片也好吃；虾米也可以替换成虾皮，蛤蜊干或者小银鱼',
        'utensil': '炒锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle019',
        'name': '山野面片',
        'ingrds0': [
            {
                'name': '韭菜',
                'amount': '1小把',
            },
            {
                'name': '鸡蛋',
                'amount': '2个',
            },
            {
                'name': '炒肉片',
                'amount': '适量',
                'link': 'prck004',
            },
            {
                'name': '老豆腐',
                'amount': '半块',
            },
            {
                'name': '黑木耳',
                'amount': '1把',
            }
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '200克面粉加100克水，和成面团，饧30分钟左右，揉光之后擀成薄片，撒上细玉米面，切成手指宽的面条',
            '韭菜摘掉老叶，洗净控干切成寸段',
            '老豆腐切成一寸见方，半厘米左右的厚片',
            '黑木耳泡发，去掉老根和沙子，撕成小片',
            '鸡蛋加半勺盐，一勺面粉打散',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '热锅凉油，下鸡蛋液，摊成薄饼，用铲子铲成菱方块，铲出待用',
            '锅里再下少量油，下老豆腐，慢火煎到两面焦黄，撒上半勺盐，少量花椒面调味',
            '下黑木耳，鸡蛋，韭菜段，炒肉片翻炒均匀，加少量生抽调味',
            '煮锅里烧开水，加一勺盐，下宽面条，煮熟后捞出，铲一勺炒好的菜铺在面条上，可以按个人口味加醋或辣椒油',
        ],
        'comments': '有次在太行山里走了两三天，在山里一家小饭店吃到这种面条，韭菜鸡蛋木耳豆腐搭配起来，味道意想不到的好',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle020',
        'name': 'biangbiang面',
        'ingrds0': [
            {
                'name': '油菜',
                'amount': '2-3颗',
            },
            {
                'name': '绿豆芽',
                'amount': '1把',
            },
            {
                'name': '面粉',
                'amount': '200克',
            }
        ],
        'ingrds1': [
            {
                'name': '大蒜',
                'amount': '2-3瓣',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '油菜掰成寸段，洗净控干',
            '绿豆芽摘掉帽子和过长的须根，洗净控干',
            '大蒜加少量盐捣成蒜泥',
            '200克面粉加100克水，和成面团，饧30分钟左右，面板上涂油，面团揉光之后擀成薄面饼，切成手指粗的条，揪住面条两端，一边抻一边在案板上biangbiang地摔打，直到把面条抻薄',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '煮锅里烧开水，加一勺盐，下宽面条，到面条快煮熟的时候下油菜和绿豆芽略焯一下',
            '青菜和豆芽捞到碗底，铺上面条，堆上蒜泥和干红辣椒面，烧热一小勺油，浇在蒜泥和辣椒面上，再在烧热油的勺子里倒一勺醋，用勺子的余温烫出醋的香气，泼在面条上',
        ],
        'comments': '用现成的油泼辣子也可以，就是仪式感上差一点儿；传统的biangbiang面是没有蔬菜的，但是我们才不在乎正不正宗呢，只在乎好不好吃',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle021',
        'name': '豆角焖面',
        'ingrds0': [
            {
                'name': '四季豆',
                'amount': '500克',
            },
            {
                'name': '猪肉',
                'amount': '100克',
            },
            {
                'name': '香菇',
                'amount': '100克',
            },
            {
                'name': '鲜面条',
                'amount': '500克',
            }
        ],
        'ingrds1': [
            {
                'name': '大蒜',
                'amount': '4-6瓣',
            },
            {
                'name': '干红辣椒',
                'amount': '3-4根',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '豆角洗净撕掉两边的老筋掰成寸段',
            '香菇切条',
            '猪肉肥瘦分开，瘦肉切丝，肥肉切丁',
            '大蒜切粒',
            '干红辣椒去蒂去籽剪段',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '热锅凉油，下肥肉丁慢火煸出油',
            '在煸出来的油里滑散瘦肉丝，到肉丝变色，下盐、生抽、料酒、花椒粉调味铲出',
            '用锅里剩余的油下一半蒜粒和干红辣椒，加一大勺黄豆酱炒香，下香菇和豆角翻炒到变色，加入没过豆角的水，撒一勺盐',
            '把面条铺在菜上面，加上炒好的肉丝，盖上锅盖，大火烧开后转小火焖 15 分钟左右到豆角熟透',
            '打开锅盖，转中火，翻炒到水收干，加入剩余的一半蒜粒，加一勺蚝油调味，翻匀出锅',
        ],
        'comments': '用四季豆和豇豆都可以，记得一定要熟透',
        'utensil': '炒锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle022',
        'name': '拌面',
        'ingrds0': [
            {
                'name': '羊肉',
                'amount': '100克',
            },
            {
                'name': '胡萝卜',
                'amount': '半根',
            },
            {
                'name': '西芹',
                'amount': '1根',
            },
            {
                'name': '洋葱',
                'amount': '半个',
            },
            {
                'name': '青椒',
                'amount': '1根',
            },
            {
                'name': '鲜面条',
                'amount': '500克',
            }
        ],
        'ingrds1': [
            {
                'name': '番茄酱',
                'amount': '2大勺',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '胡萝卜削皮斜切片',
            '西芹洗净撕掉老筋，斜切长片',
            '洋葱切片',
            '青椒去蒂去籽切片',
            '羊肉切片，加盐、生抽、半勺孜然粉、半勺辣椒粉腌入味',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '热锅凉油，下羊肉滑散铲出备用',
            '在煸出来的油里下番茄酱炒香，下胡萝卜、洋葱、芹菜、青椒翻炒到断生，加一勺盐、一勺生抽调味，加羊肉，加适量水，盖锅稍微焖一会儿',
            '在煮锅里煮熟面条，捞在盘子里，浇上炒好的菜，拌匀开吃',
        ],
        'comments': '',
        'utensil': '炒锅', '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
];
/*
豆角焖面

米粉米线

三鲜米粉
炒米粉
五彩蔬菜粉 圆白菜丝 胡萝卜丝 甜玉米 虾仁 香菇肉末
酸辣米粉
牛肉米线
红烧牛肉粉

意面

长圆面 spagheltti 8-10 min
蝴蝶面 farferlle 10-12 m
天使细面 capellini 5-8 m
贝壳面 conchiglie 8-10 m
笔管面 penne 8-10 m
宽扁面 fettuccine 8-10 m
螺旋面 fusilli 8-10 m
千层面 lasagne 5-7 m

红酱
西红柿去皮切块
洋葱碎
蒜末
综合香草 （欧芹 罗勒 迷迭香 香草粉）
黄油融化，加洋葱碎和蒜末炒出香味
加西红柿块炒成糊状
加综合香草，黑胡椒，番茄酱，盐，收汁

茄汁肉酱
牛肉碎加盐腌 5 分钟
橄榄油烧热，加蒜末，洋葱碎，去皮番茄丁，胡萝卜丁翻炒
加入牛肉碎，番茄酱，盐，黑胡椒，比萨草，炒至酱汁收稠

红酱可以和牛排，猪排，牛肉丸，火腿，炸鸡柳等肉类，
西兰花，胡萝卜，杏鲍菇，香菇，袖珍菇，洋葱，芦笋，茄子，西葫芦，炸土豆，豆角，莴笋等蔬菜随意组合搭配

千层面
烤盘或锡纸刷油，铺熟面片，茄汁肉酱，马苏里拉奶酪丝，重复三层，180度烤20分钟

白酱
适合各种海鲜
鲜虾，干贝，花蛤，金枪鱼，鱿鱼，墨鱼

黄油35克
洋葱末40克
低筋面粉20克
淡奶油80克
高汤60克
盐3克
黑胡椒1/8小勺
白葡萄酒5毫升

黄油融化，加洋葱末炒出香味，加入面粉炒匀
加入淡奶油和高汤，搅拌均匀，加入盐，黑胡椒调味
待酱汁浓稠，加入白葡萄酒搅拌均匀关火

配西兰花，白菜花，油菜花，杏鲍菇，香菇，蟹味菇，芦笋，培根等

青酱
适合各种凉拌

橄榄油
熟松子仁
西芹叶，罗勒叶
盐
黑胡椒粉
帕玛森奶酪
蒜末
水
放入搅拌机搅匀即可

配口蘑，甜椒，洋葱，紫甘蓝，黄瓜，牛奶菠菜泥，玉米粒，火腿，鸡肉，三文鱼，鳕鱼

*/
