export const noodle = [
    {
        'id': 'noodle001',
        'name': '手擀面',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '水',
                'amount': '190克',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
        ],
        'ingrds1': [
            {
                'name': '细玉米面(薄面)',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '中筋粉和水，比 2:1 略少一点儿，加一小勺盐，和成面团，醒30分钟以上',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '醒好的面团移到案板上，使劲揉到光滑',
            '用擀面杖擀成1毫米左右厚的大薄片，如果案板不够大，分成两个面团各自擀成薄片也可以，注意厚薄要均匀',
            '在面片上撒薄面，折叠起来，用刀切成韭叶宽的面条',
            '烧一锅水，水里放一勺盐，滚水下锅，控制火力保持微滚，煮3分钟左右即可捞出，可以随意搭配喜欢的浇头',
        ],
        'comments': '水越少，面越硬，和成面团以后可以包保鲜膜放冰箱冷藏4小时以上再揉，会比较容易揉',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle002',
        'name': '鸡蛋面',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '水',
                'amount': '150克',
            },
            {
                'name': '鸡蛋',
                'amount': '1个(约50克)',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
        ],
        'ingrds1': [
            {
                'name': '细玉米面(薄面)',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '中筋粉，加蛋和水，加一小勺盐，和成面团，醒30分钟以上',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '醒好的面团移到案板上，使劲揉到光滑',
            '用擀面杖擀成1毫米左右厚的大薄片，如果案板不够大，分成两个面团各自擀成薄片也可以，注意厚薄要均匀',
            '在面片上撒薄面，折叠起来，用刀切成韭叶宽的面条',
            '烧一锅水，水里放一勺盐，滚水下锅，控制火力保持微滚，煮3分钟左右即可捞出，可以随意搭配喜欢的浇头',
        ],
        'comments': '普通饭量100克面条大概够七寸碗的一碗，长身体的小孩可以下150克，饭量小的或者晚上可以下50克',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle003',
        'name': '炸酱面',
        'ingrds0': [
            {
                'name': '猪绞肉(三肥七瘦)',
                'amount': '500克',
            },
            {
                'name': '干黄酱',
                'amount': '50克',
            },
            {
                'name': '甜面酱',
                'amount': '50克',
            },
            {
                'name': '大葱',
                'amount': '1根',
            },
            {
                'name': '黄瓜',
                'amount': '1根',
            },
        ],
        'ingrds1': [
            {
                'name': '姜末',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '干黄酱用水澥开',
            '葱姜切末',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '烧热锅，下少量底油，下猪绞肉炒散，加姜末，烹料酒去腥，慢火煸出油',
            '把肉末拨开，在中间煸出的油里下干黄酱和甜面酱炒香，下葱末炸香，注意控制火力不要糊',
            '煮手擀面或者机器切面，铺上黄瓜丝，浇上炸酱',
        ],
        'comments': '也可以配胡萝卜丝，烫熟的绿豆芽，咸萝卜丁，煮黄豆，大蒜等各种菜码',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle004',
        'name': '杂酱面',
        'ingrds0': [
            {
                'name': '猪肉(三肥七瘦)',
                'amount': '500克',
            },
            {
                'name': '黄豆酱',
                'amount': '50克',
            },
            {
                'name': '甜面酱',
                'amount': '50克',
            },
            {
                'name': '芝麻花生酱',
                'amount': '50克',
            },
            {
                'name': '大葱',
                'amount': '1根',
            },
            {
                'name': '黄瓜',
                'amount': '1根',
            },
        ],
        'ingrds1': [
            {
                'name': '姜末',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '猪肉去皮，分开肥瘦，切成小丁',
            '芝麻花生酱加水澥开',
            '葱姜切末',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '烧热锅，下少量底油，下肥肉丁，慢慢煸出猪油',
            '在煸出的油里下黄豆酱、甜面酱、芝麻花生酱炒香',
            '下瘦肉炒散，加姜末，烹料酒去腥，加一点儿水，慢火熬一会儿',
            '煮手擀面或者机器切面，铺上黄瓜丝，浇上炸酱',
        ],
        'comments': '炸酱可以一次多熬一点儿，除了拌面条，夹在馒头里吃也很香',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
];

/*
茄汁肉酱面
臊子面
香菇肉末面
茄丁面
炒菜面
麻酱凉面
担担面
青椒肉丝面
酸汤羊肉面
红烧牛肉面
黄瓜鸡蛋面
丝瓜汤面
白菜鱼丸面

面片

小白菜揪面片
山野面片（韭菜豆腐木耳肉片）
biangbiang面

米粉米线

三鲜米粉
炒米粉
五彩蔬菜粉 圆白菜丝 胡萝卜丝 甜玉米 虾仁 香菇肉末
酸辣米粉
牛肉米线
红烧牛肉粉

意面

长圆面 spagheltti 8-10 min
蝴蝶面 farferlle 10-12 m
天使细面 capellini 5-8 m
贝壳面 conchiglie 8-10 m
笔管面 penne 8-10 m
宽扁面 fettuccine 8-10 m
螺旋面 fusilli 8-10 m
千层面 lasagne 5-7 m

红酱
西红柿去皮切块
洋葱碎
蒜末
综合香草 （欧芹 罗勒 迷迭香 香草粉）
黄油融化，加洋葱碎和蒜末炒出香味
加西红柿块炒成糊状
加综合香草，黑胡椒，番茄酱，盐，收汁

茄汁肉酱
牛肉碎加盐腌 5 分钟
橄榄油烧热，加蒜末，洋葱碎，去皮番茄丁，胡萝卜丁翻炒
加入牛肉碎，番茄酱，盐，黑胡椒，比萨草，炒至酱汁收稠

红酱可以和牛排，猪排，牛肉丸，火腿，炸鸡柳等肉类，
西兰花，胡萝卜，杏鲍菇，香菇，袖珍菇，洋葱，芦笋，茄子，西葫芦，炸土豆，豆角，莴笋等蔬菜随意组合搭配

千层面
烤盘或锡纸刷油，铺熟面片，茄汁肉酱，马苏里拉奶酪丝，重复三层，180度烤20分钟

白酱
适合各种海鲜
鲜虾，干贝，花蛤，金枪鱼，鱿鱼，墨鱼

黄油35克
洋葱末40克
低筋面粉20克
淡奶油80克
高汤60克
盐3克
黑胡椒1/8小勺
白葡萄酒5毫升

黄油融化，加洋葱末炒出香味，加入面粉炒匀
加入淡奶油和高汤，搅拌均匀，加入盐，黑胡椒调味
待酱汁浓稠，加入白葡萄酒搅拌均匀关火

配西兰花，白菜花，油菜花，杏鲍菇，香菇，蟹味菇，芦笋，培根等

青酱
适合各种凉拌

橄榄油
熟松子仁
西芹叶，罗勒叶
盐
黑胡椒粉
帕玛森奶酪
蒜末
水
放入搅拌机搅匀即可

配口蘑，甜椒，洋葱，紫甘蓝，黄瓜，牛奶菠菜泥，玉米粒，火腿，鸡肉，三文鱼，鳕鱼

*/
