export const noodle = [
    {
        'id': 'noodle001',
        'name': '手擀面',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '水',
                'amount': '190克',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
        ],
        'ingrds1': [
            {
                'name': '细玉米面(薄面)',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '中筋粉和水，比 2:1 略少一点儿，加一小勺盐，和成面团，醒30分钟以上',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '醒好的面团移到案板上，使劲揉到光滑',
            '用擀面杖擀成1毫米左右厚的大薄片，如果案板不够大，分成两个面团各自擀成薄片也可以，注意厚薄要均匀',
            '在面片上撒薄面，折叠起来，用刀切成韭叶宽的面条',
            '烧一锅水，水里放一勺盐，滚水下锅，控制火力保持微滚，煮3分钟左右即可捞出，可以随意搭配喜欢的浇头',
        ],
        'comments': '水越少，面越硬，和成面团以后可以包保鲜膜放冰箱冷藏4小时以上再揉，会比较容易揉',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle002',
        'name': '鸡蛋面',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '水',
                'amount': '150克',
            },
            {
                'name': '鸡蛋',
                'amount': '1个(约50克)',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
        ],
        'ingrds1': [
            {
                'name': '细玉米面(薄面)',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '中筋粉，加蛋和水，加一小勺盐，和成面团，醒30分钟以上',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '醒好的面团移到案板上，使劲揉到光滑',
            '用擀面杖擀成1毫米左右厚的大薄片，如果案板不够大，分成两个面团各自擀成薄片也可以，注意厚薄要均匀',
            '在面片上撒薄面，折叠起来，用刀切成韭叶宽的面条',
            '烧一锅水，水里放一勺盐，滚水下锅，控制火力保持微滚，煮3分钟左右即可捞出，可以随意搭配喜欢的浇头',
        ],
        'comments': '普通饭量100克面条大概够七寸碗的一碗，长身体的小孩可以下150克，饭量小的或者晚上可以下50克',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle003',
        'name': '炸酱面',
        'ingrds0': [
            {
                'name': '猪绞肉(三肥七瘦)',
                'amount': '500克',
            },
            {
                'name': '干黄酱',
                'amount': '50克',
            },
            {
                'name': '甜面酱',
                'amount': '50克',
            },
            {
                'name': '大葱',
                'amount': '1根',
            },
            {
                'name': '黄瓜',
                'amount': '1根',
            },
        ],
        'ingrds1': [
            {
                'name': '姜末',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '干黄酱用水澥开',
            '葱姜切末',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '烧热锅，下少量底油，下猪绞肉炒散，加姜末，烹料酒去腥，慢火煸出油',
            '把肉末拨开，在中间煸出的油里下干黄酱和甜面酱炒香，下葱末炸香，注意控制火力不要糊',
            '煮手擀面或者机器切面，铺上黄瓜丝，浇上炸酱',
        ],
        'comments': '也可以配胡萝卜丝，烫熟的绿豆芽，咸萝卜丁，煮黄豆，大蒜等各种菜码',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle004',
        'name': '杂酱面',
        'ingrds0': [
            {
                'name': '猪肉(三肥七瘦)',
                'amount': '500克',
            },
            {
                'name': '黄豆酱',
                'amount': '50克',
            },
            {
                'name': '甜面酱',
                'amount': '50克',
            },
            {
                'name': '芝麻花生酱',
                'amount': '50克',
            },
            {
                'name': '大葱',
                'amount': '1根',
            },
            {
                'name': '黄瓜',
                'amount': '1根',
            },
        ],
        'ingrds1': [
            {
                'name': '姜末',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '猪肉去皮，分开肥瘦，切成小丁',
            '芝麻花生酱加水澥开',
            '葱姜切末',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '烧热锅，下少量底油，下肥肉丁，慢慢煸出猪油',
            '在煸出的油里下黄豆酱、甜面酱、芝麻花生酱炒香',
            '下瘦肉炒散，加姜末，烹料酒去腥，加一点儿水，慢火熬一会儿',
            '煮手擀面或者机器切面，铺上黄瓜丝，浇上炸酱',
        ],
        'comments': '炸酱可以一次多熬一点儿，除了拌面条，夹在馒头里吃也很香',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle005',
        'name': '番茄肉酱面',
        'ingrds0': [
            {
                'name': '猪绞肉(三肥七瘦)',
                'amount': '250克',
            },
            {
                'name': '西红柿',
                'amount': '2个',
            },
            {
                'name': '番茄酱',
                'amount': '2大勺',
            },
            {
                'name': '洋葱',
                'amount': '几片',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 5,
        'prepSteps': [
            '西红柿划十字刀，在开水里烫一分钟，捞出撕掉外皮，去蒂切丁',
            '洋葱切末',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '烧热锅，下少量底油，下洋葱末和猪绞肉炒散，加盐、生抽、料酒调味',
            '下西红柿丁和西红柿酱，慢火熬煮到酱汁浓稠',
            '煮手擀面或者机器切面，浇上番茄肉酱',
        ],
        'comments': '这里的番茄酱是新疆产的罐头，不是加了一堆配料的番茄沙司',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle006',
        'name': '臊子面',
        'ingrds0': [
            {
                'name': '猪绞肉(三肥七瘦)',
                'amount': '250克',
            },
            {
                'name': '西红柿',
                'amount': '2个',
            },
            {
                'name': '土豆',
                'amount': '1个',
            },
            {
                'name': '木耳',
                'amount': '适量',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
        ],
        'prepDurInMin': 5,
        'prepSteps': [
            '木耳用水泡发，去老根，撕成小片',
            '西红柿划十字刀，在开水里烫一分钟，捞出撕掉外皮，去蒂切丁',
            '土豆削皮切丁',
            '大葱切末',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '烧热锅，下少量底油，葱花炝锅，下猪绞肉炒散，加盐、生抽、料酒调味',
            '下西红柿丁、土豆丁和木耳，加小半碗水，烧开后中小火熬煮到土豆炖烂，酱汁浓稠',
            '煮手擀面或者机器切面，浇上臊子',
        ],
        'comments': '木耳也可以换成香菇丁，也可以加黄花菜，胡萝卜丁，莴笋丁或豆腐丁',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle007',
        'name': '香菇肉丝面',
        'ingrds0': [
            {
                'name': '猪肉(三肥七瘦)',
                'amount': '250克',
            },
            {
                'name': '香菇',
                'amount': '250克',
            },
            {
                'name': '油菜',
                'amount': '2-3颗',
                'optional': true,
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '生姜',
                'amount': '几片',
            },
            {
                'name': '香葱',
                'amount': '1小根',
                'optional': true,
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '猪肉去皮，肥瘦分开，肥肉切丁，瘦肉切丝',
            '香菇切片',
            '油菜掰开叶子，洗净控干',
            '葱姜切末',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '烧热锅，下少量底油，下肥肉丁慢火煸出油',
            '在煸出来的油里滑散瘦肉丝，到肉丝变色，下葱姜末、盐、生抽、料酒调味',
            '下香菇丝翻炒，加小半碗水，烧开后中小火熬煮到汤汁浓稠',
            '煮手擀面或者机器切面，面条快煮好的时候下油菜烫熟',
            '现捞油菜铺在碗底，再捞面条，最后浇上炒好的香菇肉丝',
            '可以按个人口味撒上香葱末或油泼辣子',
        ],
        'comments': '油菜也可以换成任意绿叶菜',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle008',
        'name': '茄丁面',
        'ingrds0': [
            {
                'name': '圆茄子',
                'amount': '1个',
            },
            {
                'name': '肉臊子',
                'amount': '适量',
                'link': 'prck003',
                'optional': true,
            },
        ],
        'ingrds1': [
            {
                'name': '大蒜',
                'amount': '3-4瓣',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '茄子去蒂切丁，用盐腌半小时左右，攥出多余水分',
            '大蒜去皮切粒',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '烧热锅，倒稍微多一些油，有荤油更好',
            '下茄丁煸炒，如果有肉臊子可以加点儿，加一点儿水稍焖一会儿',
            '到茄丁软熟的时候加蒜粒，加一勺黄豆酱，少量盐和花椒粉调味',
            '煮手擀面或者机器切面',
            '浇上炒好的茄丁',
        ],
        'comments': '怕生蒜味道的同学可以先放蒜粒，让它完全熟透；喜欢重口味的同学可以最后放蒜粒或者自己就生蒜吃',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': ['口气预警'],
    },
    {
        'id': 'noodle009',
        'name': '炒菜面',
        'ingrds0': [
            {
                'name': '圆白菜',
                'amount': '半个',
            },
            {
                'name': '青椒',
                'amount': '1只',
            },
            {
                'name': '洋葱',
                'amount': '几片',
            },
            {
                'name': '炒肉片',
                'amount': '适量',
                'link': 'prck004',
                'optional': true,
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '圆白菜去硬心去老梗，切成丝',
            '青椒去蒂去籽切丝',
            '洋葱切丝',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '热锅凉油，下洋葱丝炒香',
            '下圆白菜丝，青椒丝炒到断生，加盐、生抽、花椒粉调味',
            '如果有炒肉片或者炒肉丝可以加点儿，盖锅略焖一会儿到圆白菜软熟',
            '煮手擀面或者机器切面',
            '浇上炒好的菜',
        ],
        'comments': '各种带汤汁的炒菜都可以拿来拌面条',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
    {
        'id': 'noodle010',
        'name': '麻酱凉面',
        'ingrds0': [
            {
                'name': '黄瓜',
                'amount': '1根',
            },
            {
                'name': '绿豆芽',
                'amount': '1把',
            },
        ],
        'ingrds1': [
            {
                'name': '芝麻花生酱',
                'amount': '几根',
            },
            {
                'name': '萝卜干',
                'amount': '几根',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '黄瓜切丝',
            '绿豆芽摘掉帽子和过长的须根',
            '萝卜干切丁',
            '芝麻花生酱加生抽和水澥开',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '煮手擀面或者机器切面',
            '绿豆芽焯水，和黄瓜丝、萝卜干一起铺在碗底',
            '煮好的面条过凉水，控干捞进碗里',
            '浇上澥开的芝麻花生酱',
        ],
        'comments': '可以按个人口味加蒜泥或油泼辣子',
        'utensil': '煮锅',
        'category': '主食',
        'tags': ['夏天'],
        'warnings': [''],
    },
    {
        'id': 'noodle011',
        'name': '担担面',
        'ingrds0': [
            {
                'name': '猪绞肉',
                'amount': '250克',
            },
            {
                'name': '碎米芽菜',
                'amount': '1包(100克)',
            },
            {
                'name': '豌豆尖',
                'amount': '1把',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜蒜末',
                'amount': '适量',
            },
            {
                'name': '干红辣椒',
                'amount': '3-5个',
            },
            {
                'name': '芝麻酱',
                'amount': '1勺',
            },
            {
                'name': '熟花生',
                'amount': '1把',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '豌豆尖洗净控干',
            '葱一段，姜几片，蒜两三瓣，都切成末',
            '干红辣椒去蒂去籽剪段',
            '芝麻酱加生抽和水澥开',
            '熟花生放在保鲜袋里，用擀面杖擀成花生碎',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '葱姜蒜末干红辣椒炝锅，下猪肉末炒散，慢火煸出油',
            '下碎米芽菜炒香，加澥开的芝麻酱，生抽老抽调味上色，加一点儿水或高汤熬一会儿',
            '煮手擀面或者机器切面',
            '豌豆尖焯水铺在碗底，捞进面条，浇上炒好的酱，撒上花生碎',
        ],
        'comments': '吃的时候可以按个人口味加醋，红油或者香葱末；没有豌豆尖的话可以用其他青菜叶子代替；买来的碎米芽菜有时候很咸，最好先尝一下，如果太咸的话可以用水泡一下去掉多余盐分',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [''],
        'warnings': [''],
    },
];
/*

青椒肉丝面
酸汤羊肉面
红烧牛肉面
黄瓜鸡蛋面
丝瓜汤面
白菜鱼丸面

面片

小白菜揪面片
山野面片（韭菜豆腐木耳肉片）
biangbiang面

米粉米线

三鲜米粉
炒米粉
五彩蔬菜粉 圆白菜丝 胡萝卜丝 甜玉米 虾仁 香菇肉末
酸辣米粉
牛肉米线
红烧牛肉粉

意面

长圆面 spagheltti 8-10 min
蝴蝶面 farferlle 10-12 m
天使细面 capellini 5-8 m
贝壳面 conchiglie 8-10 m
笔管面 penne 8-10 m
宽扁面 fettuccine 8-10 m
螺旋面 fusilli 8-10 m
千层面 lasagne 5-7 m

红酱
西红柿去皮切块
洋葱碎
蒜末
综合香草 （欧芹 罗勒 迷迭香 香草粉）
黄油融化，加洋葱碎和蒜末炒出香味
加西红柿块炒成糊状
加综合香草，黑胡椒，番茄酱，盐，收汁

茄汁肉酱
牛肉碎加盐腌 5 分钟
橄榄油烧热，加蒜末，洋葱碎，去皮番茄丁，胡萝卜丁翻炒
加入牛肉碎，番茄酱，盐，黑胡椒，比萨草，炒至酱汁收稠

红酱可以和牛排，猪排，牛肉丸，火腿，炸鸡柳等肉类，
西兰花，胡萝卜，杏鲍菇，香菇，袖珍菇，洋葱，芦笋，茄子，西葫芦，炸土豆，豆角，莴笋等蔬菜随意组合搭配

千层面
烤盘或锡纸刷油，铺熟面片，茄汁肉酱，马苏里拉奶酪丝，重复三层，180度烤20分钟

白酱
适合各种海鲜
鲜虾，干贝，花蛤，金枪鱼，鱿鱼，墨鱼

黄油35克
洋葱末40克
低筋面粉20克
淡奶油80克
高汤60克
盐3克
黑胡椒1/8小勺
白葡萄酒5毫升

黄油融化，加洋葱末炒出香味，加入面粉炒匀
加入淡奶油和高汤，搅拌均匀，加入盐，黑胡椒调味
待酱汁浓稠，加入白葡萄酒搅拌均匀关火

配西兰花，白菜花，油菜花，杏鲍菇，香菇，蟹味菇，芦笋，培根等

青酱
适合各种凉拌

橄榄油
熟松子仁
西芹叶，罗勒叶
盐
黑胡椒粉
帕玛森奶酪
蒜末
水
放入搅拌机搅匀即可

配口蘑，甜椒，洋葱，紫甘蓝，黄瓜，牛奶菠菜泥，玉米粒，火腿，鸡肉，三文鱼，鳕鱼

*/
