export const preCooked = [
    {
        "id": "prck001",
        "name": "可乐饼 (土豆肉饼)",
        "ingrds0": [
            {
                "name": "土豆",
                "amount": "2 个"
            },
            {
                "name": "猪绞肉",
                "amount": "500 g"
            },
            {
                "name": "洋葱",
                "amount": "1 个"
            },
            {
                "name": "鸡蛋",
                "amount": "2 个",
            },
            {
                "name": "面粉",
                "amount": "1 杯",
            },
        ],
        "ingreds1": [
            {
                "name": "姜末",
                "amount": "适量",
            },
        ],
        "prepDurInMin": 30,
        "prepSteps": [
            "土豆整个煮熟或蒸熟，去皮，捣成土豆泥",
            "猪肉馅里加姜末，盐，白胡椒，生抽，料酒，腌制 15 分钟以上",
            "洋葱切碎",
        ],
        "cookDurInMin": 30,
        "cookSteps": [
            "腌好的肉馅里加鸡蛋，土豆泥，洋葱碎，面粉，朝一个方向搅上劲",
            "烧热煎锅，抹油，用勺子舀混合肉馅，在锅里压扁成一个个小肉饼",
            "看到肉饼边缘变白，底下硬住了，就可以翻面了",
            "翻面后继续煎 3 分钟左右，到完全熟透就可以铲出锅了",
            "重复直到所有肉馅都煎成肉饼",
            "刚出锅的土豆饼可以配番茄酱直接吃",
            "一次多做一些，放冰箱，早饭夹馒头，夹面包，配米饭都可以吃"
        ],
        "comments": "商店里卖的可乐饼是裹面包糠炸出来的，家里做改成煎",
        "utensil": "",
        "category": "",
        "tags": [""],
        "warning": [],
    },
];
