export const preCooked = [
    {
        'id': 'prck001',
        'name': '可乐饼 (土豆肉饼)',
        'ingrds0': [
            {
                'name': '土豆',
                'amount': '2 个'
            },
            {
                'name': '猪绞肉',
                'amount': '500 g'
            },
            {
                'name': '洋葱',
                'amount': '1 个'
            },
            {
                'name': '鸡蛋',
                'amount': '2 个',
            },
            {
                'name': '面粉',
                'amount': '1 杯',
            },
        ],
        'ingrds1': [
            {
                'name': '姜末',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '土豆整个煮熟或蒸熟，去皮，捣成土豆泥',
            '猪肉馅里加姜末，盐，白胡椒，生抽，料酒，腌制 15 分钟以上',
            '洋葱切碎',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '腌好的肉馅里加鸡蛋，土豆泥，洋葱碎，面粉，朝一个方向搅上劲',
            '烧热煎锅，抹油，用勺子舀混合肉馅，在锅里压扁成一个个小肉饼',
            '看到肉饼边缘变白，底下硬住了，就可以翻面了',
            '翻面后继续煎 3 分钟左右，到完全熟透就可以铲出锅了',
            '重复直到所有肉馅都煎成肉饼',
            '刚出锅的土豆饼可以配番茄酱直接吃',
            '一次多做一些，放冰箱，早饭夹馒头，夹面包，配米饭都可以吃'
        ],
        'comments': '商店里卖的可乐饼是裹面包糠炸出来的，家里做改成煎',
        'utensil': '',
        'category': '半成品',
        'tags': ['高热量'],
        'warning': [],
    },
    {
        'id': 'prck002',
        'name': '炸肉丸',
        'ingrds0': [
            {
                'name': '猪绞肉',
                'amount': '1000 g'
            },
            {
                'name': '鸡蛋',
                'amount': '2 个',
            },
            {
                'name': '水淀粉',
                'amount': '1 碗',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜水',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '猪肉馅里加盐，花椒，生抽，料酒，葱姜水，腌制入味',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '肉馅里加鸡蛋，水淀粉，朝一个方向搅上劲',
            '锅里放够油，烧到六七成热（竹筷子插进去会起泡，有红外测温枪的话，160度左右）',
            '攥一把肉馅，从虎口挤出丸子，用勺子舀了沿锅边滑下去',
            '一边挤丸子一边观察锅里的丸子，看见飘起来结了一层硬壳，色泽金黄的，就可以夹起来控油晾凉了',
            '重复直到用完所有肉馅',
        ],
        'comments': '如果打算现吃的话，留一些，油温烧到八成热(180度左右)，把表面炸到焦脆出锅',
        'utensil': '炒锅',
        'category': '半成品',
        'tags': ['高热量'],
        'warning': ['油炸劝退'],
    },
    {
        'id': 'prck003',
        'name': '肉臊子',
        'ingrds0': [
            {
                'name': '猪绞肉',
                'amount': '500 g'
            },
        ],
        'ingrds1': [
            {
                'name': '姜末',
                'amount': '适量',
            },
            {
                'name': '豆瓣酱',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 0,
        'prepSteps': [],
        'cookDurInMin': 15,
        'cookSteps': [
            '烧热锅，放少量底油，放肉馅炒散',
            '炒到肉馅开始出油，拨拉到周围，在中间的油里炸香姜末和豆瓣酱',
            '加料酒去腥，放盐，生抽，花椒粉，五香粉调味，比平时炒菜的盐略重一些',
            '水分炒干出锅',
        ],
        'comments': '夹馒头，拌面条，拌米粉，或者作为各种炒菜的配菜都可以',
        'utensil': '炒锅',
        'category': '半成品',
        'tags': ['高热量', '高盐'],
        'warning': [],
    },
    {
        'id': 'prck004',
        'name': '炒肉片',
        'ingrds0': [
            {
                'name': '猪肉',
                'amount': '500 g'
            },
        ],
        'ingrds1': [
            {
                'name': '姜末',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '猪肉去皮，肥瘦分开，肥的切成小丁，瘦的切片',
        ],
        'cookDurInMin': 15,
        'cookSteps': [
            '烧热锅，放少量底油，放肥肉丁，小火慢慢煸出猪油',
            '放姜末，下肉片滑散',
            '加料酒去腥，放盐，生抽，花椒粉，五香粉调味，比平时炒菜的盐略重一些',
            '肉片完全变色出锅',
        ],
        'comments': '周末做一次，平时炒各种蔬菜都可以用',
        'utensil': '炒锅',
        'category': '半成品',
        'tags': ['高热量', '高盐'],
        'warning': [],
    },
    {
        'id': 'prck005',
        'name': '香菇肉酱',
        'ingrds0': [
            {
                'name': '猪肉',
                'amount': '500 g',
            },
            {
                'name': '香菇',
                'amount': '500 g',
            },
        ],
        'ingrds1': [
            {
                'name': '笋丁',
                'amount': '适量',
                'optional': true,
            },
            {
                'name': '熟毛豆',
                'amount': '适量',
                'optional': true,
            },
            {
                'name': '葱姜末',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 30,
        'prepSteps': [
            '猪肉去皮，肥瘦分开，切成小丁',
            '香菇切丁',
        ],
        'cookDurInMin': 15,
        'cookSteps': [
            '烧热锅，放少量底油，放肥肉丁，小火慢慢煸出猪油',
            '放姜末，下肉丁滑散',
            '肉丁变白后，下香菇丁继续翻炒',
            '如果有笋丁和熟的毛豆也可以放一些',
            '加料酒去腥，放盐，生抽，白胡椒粉调味，比平时炒菜的盐略重一些',
            '香菇炒软，水分收干后出锅',
        ],
        'comments': '家里常备的万能酱，夹馒头拌面条配米饭都可以，蒸鸡蛋羹上面放一勺也是绝妙',
        'utensil': '炒锅',
        'category': '半成品',
        'tags': ['高热量', '高盐'],
        'warning': [],
    },
    {
        'id': 'prck006',
        'name': '牛肉蘑菇辣酱 (傻狗牛肉酱)',
        'ingrds0': [
            {
                'name': '牛肉碎',
                'amount': '500 g',
            },
            {
                'name': '金针菇',
                'amount': '500 g',
            },
            {
                'name': '朝天椒',
                'amount': '500 g',
            },
            {
                'name': '红葱头',
                'amount': '2 个',
            },
        ],
        'ingrds1': [
            {
                'name': '花生碎',
                'amount': '适量',
                'optional': true,
            },
            {
                'name': '熟芝麻',
                'amount': '适量',
                'optional': true,
            },
        ],
        'prepDurInMin': 10,
        'prepSteps': [
            '红葱头，朝天椒切碎',
            '金针菇切碎',
        ],
        'cookDurInMin': 15,
        'cookSteps': [
            '烧热锅，下红葱头炒出香味',
            '下牛肉碎炒散',
            '肉末变白后，下金针菇，朝天椒继续翻炒',
            '放盐，生抽，黑胡椒粉调味，比平时炒菜的盐略重一些',
            '水分收干后加熟芝麻或者花生碎，可以放一勺糖提鲜，出锅装罐冷藏',
        ],
        'comments': '下饭拌面拌粉的万能酱，超辣，但还是架不住会有傻狗会拿个勺子空口吃掉一罐，所以也叫傻狗牛肉酱',
        'utensil': '炒锅',
        'category': '半成品',
        'tags': ['高热量', '高盐'],
        'warning': [],
    },
    {
        'id': 'prck007',
        'name': '白煮肉',
        'ingrds0': [
            {
                'name': '猪五花',
                'amount': '1000 g',
            },
        ],
        'ingrds1': [
            {
                'name': '葱姜',
                'amount': '适量',
            },
            {
                'name': '花椒',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 480,
        'prepSteps': [
            '猪肉连皮切成大概 5cm 左右的大块，在盐水里泡一夜泡出血水',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '锅里放葱姜花椒，不放盐，加足量水没过肉块',
            '开火煮到筷子可以完全扎透，捞出晾凉或者过凉水（会更脆）',
            '如果打算现吃的话，取一块切薄片，上笼大火蒸 10 分钟，可以蘸椒盐，或蒜泥酱油吃'
        ],
        'comments': '白煮肉冷藏后可以切成很薄的片，做各种回锅的菜式都可以',
        'utensil': '炒锅',
        'category': '半成品',
        'tags': ['高热量'],
        'warning': [],
    },
    /*
    红烧肉
    清炖羊肉
    红烩牛肉
    卤牛肉
    清炖鸡
    */
];
