export const seafood = [
    {
        'id': 'seafood001',
        'name': '干煸鲜虾海鲜粉丝煲',
        'ingrds0': [
            {
                'name': '干粉丝',
                'amount': '150g',
            },
            {
                'name': '海白虾',
                'amount': '8个',
            },
        ],
        'ingrds1': [
            {
                'name': '鱿鱼圈',
                'amount': '50g',
                'optional': true,
            },
            {
                'name': '贻贝肉',
                'amount': '50g',
                'optional': true,
            },
            {
                'name': '扇贝柱',
                'amount': '50g',
                'optional': true,
            },
            {
                'name': '鱿鱼须',
                'amount': '50g',
                'optional': true,
            },
            {
                'name': '小葱',
                'amount': '2-3根',
            },
            {
                'name': '生姜',
                'amount': '4-5片',
            },
            {
                'name': '洋葱',
                'amount': '半个',
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '150g干龙口粉丝放入没过粉丝的温水，浸泡15分钟。捞出粉丝加1/2勺生抽、1/2勺食用油抓拌均匀。',
            '8个白虾去壳去头，开背去虾线，虾头留用。',
            '半锅水大火煮沸后加入虾仁，和一些别的海鲜（50g鱿鱼圈+50g贻贝肉+50g扇贝柱+50g鱿鱼须），再加入1个小葱结，4片姜片和1勺料酒。大火30秒捞出海鲜和虾仁。',
        ],
        'cookDurInMin': 5,
        'cookSteps': [
            '取一铸铁锅（或者砂锅），锅中放入1勺食用油，中火加入虾头煸炒1分钟，炒出虾油。',
            '虾头捞出弃用，加2勺蒜末、1勺姜末、半个洋葱切丝，翻炒均匀，再加入焯水后的海鲜和虾仁翻炒均匀。',
            '加入粉丝，淋上酱汁(2勺生抽+半勺香辣酱+1/3勺白砂糖搅拌均匀)，翻拌均匀，最后淋入1勺料酒，关盖小火焗1分钟，开盖撒半勺小米辣圈，1勺小葱。',
        ],
        'comments': '',
        'utensil': '砂锅',
        'category': '炒菜',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'seafood002',
        'name': '蒜蓉海鲜粉丝煲',
        'ingrds0': [
            {
                'name': '鲍鱼',
                'amount': '4-5头',
            },
            {
                'name': '生蚝',
                'amount': '3-4个',
            },
            {
                'name': '黑虎虾',
                'amount': '5-6只',
            },
            {
                'name': '蛏子',
                'amount': '5-6个',
            },
            {
                'name': '干粉丝',
                'amount': '150g',
            },
            {
                'name': '五花肉',
                'amount': '200g',
            },
            {
                'name': '娃娃菜',
                'amount': '200g',
            },
        ],
        'ingrds1': [
            {
                'name': '小葱',
                'amount': '2-3根',
            },
            {
                'name': '生姜',
                'amount': '4-5片',
            },
            {
                'name': '大蒜',
                'amount': '半头',
            },
            {
                'name': '小米辣',
                'amount': '2-3只',
            },
        ],
        'prepDurInMin': 15,
        'prepSteps': [
            '处理鲍鱼，温水加盐刷洗掉裙边黑膜，剪掉内脏和口器，切格纹花刀。',
            '生蚝加盐抓拌至浮出灰色粘液，清水洗净。',
            '黑虎虾仁开背去虾线。',
            '蛏子入温水，盖盖上下摇晃5-6次，方便后续淘洗干净。',
            '五花肉切厚片',
            '娃娃菜切丝',
            '粉丝用温盐水泡发',
        ],
        'cookDurInMin': 5,
        'cookSteps': [
            '炒酱料：锅中加2勺食用油，开小火，加入2勺蒜末、2勺小米椒圈炒香后关火，加入2勺生抽、1勺老抽、1勺香醋、1勺蒸鱼豉油、1/4勺白砂糖、1/4勺白胡椒粉、1勺蚝油搅拌均匀备用。',
            '砂锅（或其他厚底锅）锅底刷层薄油，开中火，放入200g五花肉片煎出油脂后关火。',
            '铺上半颗娃娃菜叶、1把泡发的粉丝（提前用温水浸泡15分钟）和处理好的海鲜，倒上炒好的酱料和1碗清水。',
            '加入粉丝，淋上酱汁(2勺生抽+半勺香辣酱+1/3勺白砂糖搅拌均匀)，翻拌均匀，最后淋入1勺料酒，关盖小火焗1分钟，开盖撒半勺小米辣圈，1勺小葱。',
            '中火盖盖焖煮6分钟，可以加入一些蟹肉棒（如果你喜欢的话）继续焖2分钟，开盖撒上半勺葱花、半勺小米椒圈。',
        ],
        'comments': '',
        'utensil': '砂锅',
        'category': '炒菜',
        'tags': [],
        'warnings': [],
    },
];
