export const wheat = [
    {
        'id': 'wheat001',
        'name': '馒头',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
            {
                'name': '牛奶',
                'amount': '50克',
                'optional': true,
            },
            {
                'name': '白糖',
                'amount': '10克',
                'optional': true,
            },
            {
                'name': '猪油',
                'amount': '10克',
                'optional': true,
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '面粉中间留个窝，放白糖，猪油，温水，牛奶，干酵母，搅匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，分成100g左右一个的小团，揉圆，在案板上放30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '白糖帮助发酵，牛奶和猪油改善口感，可加可不加；喜欢瓷实口感的就在整形的时候多揉干面',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat002',
        'name': '发面饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '300克',
            },
            {
                'name': '玉米面(细)',
                'amount': '100克',
            },
            {
                'name': '豆面',
                'amount': '100克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '300克',
            },
            {
                'name': '奶粉',
                'amount': '50克',
                'optional': true,
            },
            {
                'name': '白糖',
                'amount': '30克',
            },
            {
                'name': '猪油',
                'amount': '20克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '面粉中间留个窝，放奶粉，白糖，猪油，温水，干酵母，搅匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，分成100g左右一个的小团，揉圆，擀成直径大概10cm左右的小饼，在案板上放30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅烧热，不放油，放小饼烙到两面略黄，用竹签扎一些洞防止胀气',
            '烤箱预热好，170度上下火烤15分钟左右',
        ],
        'comments': '打豆浆剩下的豆渣也很适合用来烙大饼，绝不浪费一点儿粮食^-^',
        'utensil': '煎锅, 烤箱',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat003',
        'name': '胡饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '300克',
            },
            {
                'name': '奶粉',
                'amount': '50克',
            },
            {
                'name': '洋葱',
                'amount': '几片',
            },
            {
                'name': '白糖',
                'amount': '20克',
            },
            {
                'name': '植物油',
                'amount': '20克',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
            {
                'name': '白芝麻(熟)',
                'amount': '适量',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '洋葱捣碎，用纱布包住攥出汁(可以带泳镜防止辣眼睛)',
            '面粉中间留个窝，放奶粉，糖，油，盐，洋葱汁，温水，干酵母，搅匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，分成100g左右一个的剂子',
            '每个剂子揉圆，擀成直径大概10cm左右的小饼，在案板上放30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '用叉子在小饼表面扎些小孔，刷一点儿油，撒白芝麻，轻拍固定',
            '烤箱预热好，170度上下火烤20分钟左右',
        ],
        'comments': '吃起来像馕但要软一些',
        'utensil': '烤箱',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat004',
        'name': '烫面饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '600克',
            },
            {
                'name': '沸水(100度左右)',
                'amount': '150克',
            },
            {
                'name': '室温水(25度左右)',
                'amount': '150克',
            },
            {
                'name': '植物油',
                'amount': '10克',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '面粉中间留个窝，倒开水，搅和成团，倒室温水，放盐和油，醒30分钟左右',
            '醒好的面团放到案板上揉光，分成100g左右的剂子',
            '每个剂子揉圆，擀成煎锅大小的薄饼',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅烧热抹油，放薄饼，两面煎到焦黄',
        ],
        'comments': '烫面放凉了也不会硬，适合用来卷各种菜',
        'utensil': '烤箱',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat005',
        'name': '葱油饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '200克',
            },
            {
                'name': '室温水(25度左右)',
                'amount': '100克',
            },
            {
                'name': '大葱',
                'amount': '适量',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '面粉中间留个窝，倒水，搅和成团，醒30分钟左右',
            '醒好的面团放到案板上揉光，擀成一大张薄的面片',
            '葱切成葱花，下锅煎到焦黄，放盐，花椒粉调成葱油',
            '把葱油抹在面皮上，像叠被子一样折叠成饼',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '煎锅烧热抹油，放葱油饼，两面煎到焦黄',
        ],
        'comments': '包饺子剩下的面团可以用这个方法做成饼，但是因为是死面的，放凉了就不好吃了，最好趁热吃掉',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat006',
        'name': '煎饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '100克',
            },
            {
                'name': '豆面',
                'amount': '100克',
            },
            {
                'name': '室温水(25度左右)',
                'amount': '700克',
            },
            {
                'name': '鸡蛋',
                'amount': '2-3个',
            },
            {
                'name': '油',
                'amount': '10g',
            },
            {
                'name': '盐',
                'amount': '3g',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '面粉，盐，鸡蛋，水，油混合成面糊。放置30分钟以上让面糊里没有小疙瘩',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅烧热抹油，倒一勺面糊，用刮子或铲子摊匀成薄饼，等薄饼表面完全变色，边缘略翘起，小心翻面，把另一面也烙到焦黄出锅',
        ],
        'comments': '适合用来卷各种菜吃',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat007',
        'name': '糊塌子',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '100克',
            },
            {
                'name': '西葫芦',
                'amount': '1个',
            },
            {
                'name': '室温水(25度左右)',
                'amount': '200克',
            },
            {
                'name': '鸡蛋',
                'amount': '3-4个',
            },
            {
                'name': '油',
                'amount': '10g',
            },
            {
                'name': '盐',
                'amount': '3g',
            },
            {
                'name': '葱花',
                'amount': '适量',
            },
            {
                'name': '虾皮',
                'amount': '适量',
                'optional': true,
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '西葫芦擦细丝，加葱花，虾皮，面粉，盐，鸡蛋，水，油混合成面糊，放置30分钟以上等西葫芦里的水分出来面糊变稀',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅烧热抹油，倒一勺面糊，用刮子或铲子摊匀成薄饼，等薄饼表面完全变色，边缘略翘起，小心翻面，把另一面也烙到焦黄出锅',
        ],
        'comments': '平菇，白萝卜也可以用类似的方法烙成饼',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat008',
        'name': '花卷',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '300克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '面粉加干酵母，倒温水，搅匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，擀成长方形，抹上油，撒盐、花椒粉、苦豆粉，沿长边卷起来，压扁，切成段',
            '两段面卷叠起来，沿中轴用筷子压一下，然后两手捏住两头，拧成花，再把两头捏在一起（这个描述实在抽象，找个视频看一下会更清楚）',
            '拧好的花卷放在案板上继续发酵30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '苦豆粉是西北特产的一种调味品，可以网购，有种特别的香气；不喜欢咸味花卷的，也可以按自己口味放麻酱红糖做成甜口的',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat009',
        'name': '懒龙',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '300克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
            {
                'name': '猪绞肉',
                'amount': '250克',
            },
            {
                'name': '大葱',
                'amount': '半根',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '面粉加干酵母，倒温水，搅匀成团，发酵到原来的两倍大',
            '猪绞肉加盐、料酒、生抽、花椒粉、油、葱末调成馅料',
            '发酵好的面团放到案板上轻揉让它排气，擀成长方形，抹上肉馅，沿长边卷起来成粗条',
            '卷好的肉龙放在案板上继续发酵30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
            '出锅切成段吃',
        ],
        'comments': '小朋友们喜欢的食物，可能是因为名字好玩，可以玩各种龙的梗',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
];
/*
煎饼卷黑椒牛柳
煎饼卷京酱肉丝
煎饼卷和菜

包子
    猪肉大葱
    麻婆豆腐
    茄丁
    青菜
馅饼
    猪肉
    牛肉
    莲藕
饺子
    白菜
    黄心菜
    香芹
    韭菜
    韭黄
    小白菜
煎饺
    豇豆
馄饨
    猪肉
    三鲜(虾仁、猪肉、香菇)
    荠菜
水煎包
    三鲜(猪肉鸡蛋木耳香菇)
泡馍
    羊肉
    牛肉
*/
