export const wheat = [
    {
        'id': 'wheat001',
        'name': '馒头',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
            {
                'name': '牛奶',
                'amount': '50克',
                'optional': true,
            },
            {
                'name': '白糖',
                'amount': '10克',
                'optional': true,
            },
            {
                'name': '猪油',
                'amount': '10克',
                'optional': true,
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '面粉中间留个窝，放白糖，猪油，温水，牛奶，干酵母，搅匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，分成100g左右一个的小团，揉圆，在案板上放30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '白糖帮助发酵，牛奶和猪油改善口感，可加可不加；喜欢瓷实口感的就在整形的时候多揉干面',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat002',
        'name': '发面饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '300克',
            },
            {
                'name': '玉米面(细)',
                'amount': '100克',
            },
            {
                'name': '豆面',
                'amount': '100克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '300克',
            },
            {
                'name': '奶粉',
                'amount': '50克',
                'optional': true,
            },
            {
                'name': '白糖',
                'amount': '30克',
            },
            {
                'name': '猪油',
                'amount': '20克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '面粉中间留个窝，放奶粉，白糖，猪油，温水，干酵母，搅匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，分成100g左右一个的小团，揉圆，擀成直径大概10cm左右的小饼，在案板上放30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅烧热，不放油，放小饼烙到两面略黄，用竹签扎一些洞防止胀气',
            '烤箱预热好，170度上下火烤15分钟左右',
        ],
        'comments': '打豆浆剩下的豆渣也很适合用来烙大饼，绝不浪费一点儿粮食^-^',
        'utensil': '煎锅, 烤箱',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat003',
        'name': '胡饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '300克',
            },
            {
                'name': '奶粉',
                'amount': '50克',
            },
            {
                'name': '洋葱',
                'amount': '几片',
            },
            {
                'name': '白糖',
                'amount': '20克',
            },
            {
                'name': '植物油',
                'amount': '20克',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
            {
                'name': '白芝麻(熟)',
                'amount': '适量',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '洋葱捣碎，用纱布包住攥出汁(可以带泳镜防止辣眼睛)',
            '面粉中间留个窝，放奶粉，糖，油，盐，洋葱汁，温水，干酵母，搅匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，分成100g左右一个的剂子',
            '每个剂子揉圆，擀成直径大概10cm左右的小饼，在案板上放30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '用叉子在小饼表面扎些小孔，刷一点儿油，撒白芝麻，轻拍固定',
            '烤箱预热好，170度上下火烤20分钟左右',
        ],
        'comments': '吃起来像馕但要软一些',
        'utensil': '烤箱',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat004',
        'name': '烫面饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '600克',
            },
            {
                'name': '沸水(100度左右)',
                'amount': '150克',
            },
            {
                'name': '室温水(25度左右)',
                'amount': '150克',
            },
            {
                'name': '植物油',
                'amount': '10克',
            },
            {
                'name': '盐',
                'amount': '3克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '面粉中间留个窝，倒开水，搅和成团，倒室温水，放盐和油，饧30分钟左右',
            '饧好的面团放到案板上揉光，分成100g左右的剂子',
            '每个剂子揉圆，擀成煎锅大小的薄饼',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅烧热抹油，放薄饼，两面煎到焦黄',
        ],
        'comments': '烫面放凉了也不会硬，适合用来卷各种菜',
        'utensil': '烤箱',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat005',
        'name': '葱油饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '200克',
            },
            {
                'name': '室温水(25度左右)',
                'amount': '100克',
            },
            {
                'name': '大葱',
                'amount': '适量',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '面粉中间留个窝，倒水，搅和成团，饧30分钟左右',
            '饧好的面团放到案板上揉光，擀成一大张薄的面片',
            '葱切成葱花，下锅煎到焦黄，放盐，花椒粉调成葱油',
            '把葱油抹在面皮上，像叠被子一样折叠成饼',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '煎锅烧热抹油，放葱油饼，两面煎到焦黄',
        ],
        'comments': '包饺子剩下的面团可以用这个方法做成饼，但是因为是死面的，放凉了就不好吃了，最好趁热吃掉',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat006',
        'name': '煎饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '100克',
            },
            {
                'name': '豆面',
                'amount': '100克',
            },
            {
                'name': '室温水(25度左右)',
                'amount': '700克',
            },
            {
                'name': '鸡蛋',
                'amount': '2-3个',
            },
            {
                'name': '油',
                'amount': '10g',
            },
            {
                'name': '盐',
                'amount': '3g',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '面粉，盐，鸡蛋，水，油混合成面糊。放置30分钟以上让面糊里没有小疙瘩',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅烧热抹油，倒一勺面糊，用刮子或铲子摊匀成薄饼，等薄饼表面完全变色，边缘略翘起，小心翻面，把另一面也烙到焦黄出锅',
        ],
        'comments': '适合用来卷各种菜吃',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat007',
        'name': '糊塌子',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '100克',
            },
            {
                'name': '西葫芦',
                'amount': '1个',
            },
            {
                'name': '室温水(25度左右)',
                'amount': '200克',
            },
            {
                'name': '鸡蛋',
                'amount': '3-4个',
            },
            {
                'name': '油',
                'amount': '10g',
            },
            {
                'name': '盐',
                'amount': '3g',
            },
            {
                'name': '葱花',
                'amount': '适量',
            },
            {
                'name': '虾皮',
                'amount': '适量',
                'optional': true,
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '西葫芦擦细丝，加葱花，虾皮，面粉，盐，鸡蛋，水，油混合成面糊，放置30分钟以上等西葫芦里的水分出来面糊变稀',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅烧热抹油，倒一勺面糊，用刮子或铲子摊匀成薄饼，等薄饼表面完全变色，边缘略翘起，小心翻面，把另一面也烙到焦黄出锅',
        ],
        'comments': '平菇，白萝卜也可以用类似的方法烙成饼',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat008',
        'name': '花卷',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '300克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '面粉加干酵母，倒温水，搅匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，擀成长方形，抹上油，撒盐、花椒粉、苦豆粉，沿长边卷起来，压扁，切成段',
            '两段面卷叠起来，沿中轴用筷子压一下，然后两手捏住两头，拧成花，再把两头捏在一起（这个描述实在抽象，找个视频看一下会更清楚）',
            '拧好的花卷放在案板上继续发酵30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
            '除了椒盐口味，还可以用小火炸香葱花做成葱香花卷；或者加上剁碎的火腿肠粒变成香肠葱花卷；喜欢重口味的可以卷油爆剁椒；喜欢甜口的可以放麻酱红糖',
        ],
        'comments': '',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat009',
        'name': '懒龙',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '300克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
            {
                'name': '猪绞肉',
                'amount': '250克',
            },
            {
                'name': '大葱',
                'amount': '半根',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 180,
        'prepSteps': [
            '面粉加干酵母，倒温水，搅匀成团，发酵到原来的两倍大',
            '猪绞肉加盐、料酒、生抽、花椒粉、油、葱末调成馅料',
            '发酵好的面团放到案板上轻揉让它排气，擀成长方形，抹上肉馅，沿长边卷起来成粗条',
            '卷好的肉龙放在案板上继续发酵30分钟左右',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
            '出锅切成段吃',
        ],
        'comments': '小朋友们喜欢的食物，可能是因为名字好玩，可以玩各种龙的梗',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat010',
        'name': '麻食',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '180克',
            },
            {
                'name': '猪肉(三肥七瘦)',
                'amount': '250克',
            },
            {
                'name': '北豆腐',
                'amount': '半块',
            },
            {
                'name': '香菇',
                'amount': '7-8朵',
            },
            {
                'name': '豇豆',
                'amount': '1小把',
            },
            {
                'name': '土豆',
                'amount': '1个',
            },
            {
                'name': '胡萝卜',
                'amount': '1个',
            },
            {
                'name': '圆茄子',
                'amount': '1个',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '面粉加温水(1:0.45)，和成比较硬的面团，饧30分钟左右',
            '猪肉分开肥瘦，切丁，瘦肉丁加盐、料酒、生抽、花椒粉、油码入味',
            '北豆腐切丁泡盐水去豆腥味',
            '土豆、胡萝卜去皮，和香菇、豇豆、茄子一起切丁',
            '茄丁用盐腌30分钟左右，攥出多余的水分',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '热锅凉油，下北豆腐丁，加少量盐和花椒粉，慢火炕成表面略黄的豆腐丁，铲出待用',
            '锅里下肥肉丁，慢火煎出油，下瘦肉丁炒到变色，铲出待用',
            '利用锅里的荤油，煎茄丁和香菇丁，加两大勺黄豆酱炒香',
            '下土豆、胡萝卜、豆腐丁、肉丁，加一大碗水，煮开后转小火慢炖20分钟左右，到土豆绵软，所有蔬菜熟透，加盐和花椒粉调味',
            '面团揉光，擀成1厘米厚的面饼，切成手指粗的条，搓细成比筷子略粗的长条',
            '从长面条头上揪黄豆大的一小团面，用在竹帘上斜角方向边压边搓(这个动作比较难形容，土话叫ci1声，找个视频看一下会更清楚)，成中空的外表带花的小卷(陕西叫麻食，北京叫猫耳朵)，重复直到所有面都做成麻食',
            '烧开一大锅水，下一大勺盐，下麻食，煮5分钟左右，到麻食飘起来，加煮好的菜，再煮5分钟左右，到面和菜完全入味',
            '一大锅麻食一般一顿吃不完，剩下的麻食在锅里炒一下更好吃，有麻食姓张，越热越香的说法(人们为了押韵真是什么都能编的出来)',
        ],
        'comments': '小时候和爸爸妈妈一起搓麻食，包饺子的记忆是童年里最愉快的部分，吃的过程倒在其次，家人一起做的过程才是重点。否则的话如果只是一个人在厨房里忙两个小时，端出来大家各自玩着手机，心不在焉地十分钟吃完就走，就毫无意义了',
        'utensil': '炒锅,煮锅',
        'category': '主食',
        'tags': ['省牙', '冬天'],
        'warnings': [],
    },
    {
        'id': 'wheat011',
        'name': '煮馍',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '200克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '110克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
            {
                'name': '清炖羊肉',
                'amount': '1块',
                'link': 'prck011',
            },
            {
                'name': '粉丝',
                'amount': '1把',
            },
            {
                'name': '白萝卜',
                'amount': '半根',
            },
            {
                'name': '黑木耳',
                'amount': '几朵',
            },
            {
                'name': '黄花菜',
                'amount': '一小把',
            },
            {
                'name': '青蒜',
                'amount': '1根',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 30,
        'prepSteps': [
            '面粉加温水(1:0.55)，酵母粉，和成面团，饧30分钟左右，不用完全发起来',
            '面团加干面粉揉光，擀成手掌厚的面饼，烧热锅，放入面饼，烙到两面微黄，面饼变硬，用铲子翘起来砰砰响即可(七八分熟)',
            '羊肉块改刀成片',
            '粉丝泡发',
            '白萝卜切片焯水',
            '黑木耳和黄花菜泡发，去掉老的蒂，撕成小片',
            '青蒜切细末',
        ],
        'cookDurInMin': 30,
        'cookSteps': [
            '等面饼放到不烫手，掰成块，然后用指尖掐成黄豆大的粒，最好大小均匀',
            '锅里下羊肉汤和水烧滚，下掰好的馍块，煮5分钟左右',
            '到馍块熟透，下白萝卜，粉丝，黄花木耳，羊肉，加适量盐调味，再煮一会儿到菜和馍都入味',
            '撒白胡椒和青蒜末出锅',
            '这个量是差不多两三人的，如果人多，最好分几锅煮，尤其是当各人掰的馍粒大小不一的时候最好不要混起来',
            '羊肉也可以换成牛肉',
        ],
        'comments': '可以按个人口味加青蒜、香菜、糖蒜或者辣椒酱',
        'utensil': '炒锅,煎锅',
        'category': '主食',
        'tags': ['省牙', '冬天'],
        'warnings': [],
    },
    {
        'id': 'wheat012',
        'name': '泡馍',
        'ingrds0': [
            {
                'name': '发面饼',
                'amount': '1个',
                'link': 'wheat002',
            },
            {
                'name': '清炖羊肉',
                'amount': '1块',
                'link': 'prck011',
            },
            {
                'name': '粉丝',
                'amount': '1把',
            },
            {
                'name': '青蒜',
                'amount': '1根',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 10,
        'prepSteps': [
            '羊肉块改刀成片',
            '粉丝泡发',
            '青蒜切细末',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '如果不是刚出炉的发面饼的话，烤箱预热 170 度热 5 分钟就可以像刚出炉一样酥脆',
            '锅里下羊肉汤和水烧滚，加适量盐和白胡椒调味',
            '抓一人份的羊肉和粉丝到碗里，舀半碗热汤，在碗里荡一会儿，把汤倒回锅里，可以重复两三次到羊肉热透但不碎',
            '重新再舀半碗热汤，撒白胡椒和青蒜末出锅',
            '可以把馍掰成块泡进汤里，也可以就着羊肉汤吃',
        ],
        'comments': '可以按个人口味加青蒜、香菜、糖蒜或者辣椒酱',
        'utensil': '炒锅',
        'category': '主食',
        'tags': ['省牙', '冬天'],
        'warnings': [],
    },
    {
        'id': 'wheat013',
        'name': '南瓜馒头',
        'ingrds0': [
            {
                'name': '老南瓜',
                'amount': '200克',
            },
            {
                'name': '中筋粉',
                'amount': '360克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '30克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '南瓜蒸熟，晾凉到不烫手，过筛成泥',
            '干酵母加温水搅拌均匀成酵母水',
            '南瓜泥中加入酵母水和面粉拌匀，揉匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，分成 100g 左右一个的小团，揉圆，在案板上放 30 分钟左右二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '南瓜的含水量不同品种和季节会不一样，可以在和面的时候根据手感适量增减面粉量',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat014',
        'name': '豆渣馒头',
        'ingrds0': [
            {
                'name': '豆渣',
                'amount': '120克',
            },
            {
                'name': '中筋粉',
                'amount': '300克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '15克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '豆渣晾凉到不烫手',
            '干酵母加温水搅拌均匀成酵母水',
            '豆渣中加入酵母水和面粉拌匀，揉匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，分成 100g 左右一个的小团，揉圆，在案板上放 30 分钟左右二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '打完豆浆的豆渣还有很多蛋白质不能浪费，不用来喂猪就用来喂自己吧^-^',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat015',
        'name': '燕麦馒头',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '300克',
            },
            {
                'name': '燕麦片',
                'amount': '50克',
            },
            {
                'name': '牛奶',
                'amount': '70克',
            },
            {
                'name': '鸡蛋',
                'amount': '1个(50克左右)',
            },
            {
                'name': '白糖',
                'amount': '50克',
            },
            {
                'name': '干酵母',
                'amount': '4克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '50克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '燕麦片用清水泡 10 分钟左右，沥干水分',
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加泡软的燕麦片、白糖、酵母水、蛋液、牛奶拌匀，揉匀成团，发酵到原来的两倍大',
            '发酵好的面团放到案板上轻揉让它排气，分成 100g 左右一个的小团，揉圆，在案板上放 30 分钟左右二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat016',
        'name': '元宝馒头',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '胡萝卜',
                'amount': '250克',
            },
            {
                'name': '菠菜',
                'amount': '300克',
            },
            {
                'name': '猪肉馅',
                'amount': '100克',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '70克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '胡萝卜蒸熟，打成泥',
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '菠菜去根洗净，焯水后攥干水分，剁成末',
            '猪肉馅加半勺盐、一勺生抽、半勺胡椒粉、一勺白糖，少量葱姜末搅匀',
            '菠菜加一勺油拌匀，加入肉馅搅匀',
            '发酵好的面团放到案板上轻揉让它排气，分成 60g 左右一个的小团，揉圆，擀成皮',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '一个面皮上放大概40克左右的馅，捏成口袋样，两头压扁后往中间推，中间捏一下，形成两头上翘中间圆圆的元宝形状，放在案板上二次发酵',
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat017',
        'name': '香米腊肠卷',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '300克',
            },
            {
                'name': '腊肠',
                'amount': '100克',
            },
            {
                'name': '香米饭',
                'amount': '80克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '150克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '腊肠蒸熟后切小丁，加盐、酱油、胡椒粉、熟花生碎、米饭拌匀',
            '发酵好的面团放到案板上轻揉让它排气擀成两张半厘米厚的长方大片',
            '在面皮上摊匀米饭腊肠碎，卷起来两头封住，放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
            '取出来切成段吃',
        ],
        'comments': '',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat018',
        'name': '蜂蜜红豆卷',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '250克',
            },
            {
                'name': '红豆',
                'amount': '100克',
            },
            {
                'name': '白糖',
                'amount': '30克',
            },
            {
                'name': '干酵母',
                'amount': '3克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '120克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '红豆提前泡一夜，蒸 30 分钟，在炒锅里一边翻炒一边加入白糖和蜂蜜，到水分基本炒干即可，不用打成泥，带豆粒的口感更好',
            '发酵好的面团放到案板上轻揉让它排气，擀成两张半厘米厚的长方大片',
            '在面皮上摊匀红豆馅，卷起来两头封住，放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸15分钟左右，关火，不要开盖，继续焖5分钟',
            '取出来切成段吃',
        ],
        'comments': '如果用包包子的方法做出来就是豆包，味道是一样的',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat019',
        'name': '猪肉大葱包',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '猪绞肉',
                'amount': '400克',
            },
            {
                'name': '大葱',
                'amount': '50克',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '猪绞肉加花椒水、葱末、盐、生抽、五香粉、油拌匀搅上劲',
            '发酵好的面团放到案板上轻揉让它排气，切成大约 50 克左右的剂子',
            '把剂子擀成中间厚，边上薄的包子皮，每个皮中间放大约 50 克左右肉馅，一边提一边转捏出褶来包拢',
            '包好的包子放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸10分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat020',
        'name': '麻婆豆腐包',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '老豆腐',
                'amount': '400克',
            },
            {
                'name': '榨菜',
                'amount': '50克',
            },
            {
                'name': '香葱',
                'amount': '50克',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '老豆腐切丁，用开水烫过去豆腥味',
            '锅里烧热一大勺油，加一大勺剁细的郫县豆瓣、一勺辣椒粉、一勺花椒粉，关火，利用余温把调料烫熟',
            '老豆腐沥干水分，加榨菜碎、香葱碎、盐、生抽、熟芝麻或者花生碎，以及刚才烫熟的调料拌匀',
            '发酵好的面团放到案板上轻揉让它排气，切成大约 50 克左右的剂子',
            '把剂子擀成中间厚，边上薄的包子皮，每个皮中间放大约 50 克左右馅，一边提一边转捏出褶来包拢',
            '包好的包子放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸10分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '因为是素包子，放凉了也一样好吃，很适合野餐或带饭',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙', '适合带饭'],
        'warnings': [],
    },
    {
        'id': 'wheat021',
        'name': '茄丁包',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '大圆茄子',
                'amount': '1个',
            },
            {
                'name': '青椒',
                'amount': '2根',
            },
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '茄子切丁，撒一勺盐，腌半个小时左右，攥干多余水分',
            '青椒去蒂去籽切末',
            '大葱切末',
            '茄丁加青椒末、葱末、油一大勺、黄豆酱一大勺、生抽一勺、花椒粉半小勺拌匀',
            '发酵好的面团放到案板上轻揉让它排气，切成大约 50 克左右的剂子',
            '把剂子擀成中间厚，边上薄的包子皮，每个皮中间放大约 50 克左右馅，一边提一边转捏出褶来包拢',
            '包好的包子放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸10分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '调馅的也可以加一勺猪油，出来的包子更香',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙', '适合带饭'],
        'warnings': [],
    },
    {
        'id': 'wheat022',
        'name': '青菜包',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '菠菜',
                'amount': '500克',
            },
            {
                'name': '五香豆干',
                'amount': '3-4块',
            },
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '菠菜去根去老叶，洗净焯水，晾凉后攥掉多余水分，剁成末',
            '豆腐干切末',
            '大葱切末',
            '菠菜末加豆干末、葱末、油一大勺、生抽一勺、蚝油一勺、胡椒粉半小勺拌匀',
            '发酵好的面团放到案板上轻揉让它排气，切成大约 50 克左右的剂子',
            '把剂子擀成中间厚，边上薄的包子皮，每个皮中间放大约 50 克左右馅，一边提一边转捏出褶来包拢',
            '包好的包子放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸10分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '菠菜可以换成小白菜或者其他应季青菜，还可以加一点儿虾皮增加鲜味',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙', '适合带饭'],
        'warnings': [],
    },
    {
        'id': 'wheat023',
        'name': '胡萝卜莲花菜包',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '莲花菜',
                'amount': '半颗',
            },
            {
                'name': '胡萝卜',
                'amount': '1根',
            },
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '虾皮',
                'amount': '1把',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '莲花菜切丝',
            '胡萝卜擦丝',
            '大葱切末',
            '锅里放少量底油，加葱花、虾皮、胡萝卜丝、莲花菜丝略炒，去掉多余水分、加油一大勺、生抽一勺、蚝油一勺、胡椒粉半小勺拌匀',
            '发酵好的面团放到案板上轻揉让它排气，切成大约 50 克左右的剂子',
            '把剂子擀成中间厚，边上薄的包子皮，每个皮中间放大约 50 克左右馅，一边提一边转捏出褶来包拢',
            '包好的包子放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸10分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '也可以不炒，用盐腌一下莲花菜丝和胡萝卜丝，然后挤掉多余水分，个人觉得炒一下更香',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙', '适合带饭'],
        'warnings': [],
    },
    {
        'id': 'wheat024',
        'name': '木耳鸡蛋包',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '鲜黑木耳',
                'amount': '200克',
            },
            {
                'name': '鸡蛋',
                'amount': '4-5颗',
            },
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '鲜黑木耳去蒂切末，或者干的黑木耳泡发，切成末',
            '鸡蛋加盐打散，在锅里炒熟',
            '大葱切末',
            '木耳末里加炒熟的鸡蛋和葱花，加盐半小勺、生抽一勺、蚝油一勺、胡椒粉半小勺拌匀',
            '发酵好的面团放到案板上轻揉让它排气，切成大约 50 克左右的剂子',
            '把剂子擀成中间厚，边上薄的包子皮，每个皮中间放大约 50 克左右馅，一边提一边转捏出褶来包拢',
            '包好的包子放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '大火上笼，蒸10分钟左右，关火，不要开盖，继续焖5分钟',
        ],
        'comments': '以前在西北吃过地衣包子，虽然美味，但是听说采集地衣的过程对环境破坏非常大，换成黑木耳味道一样鲜美',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙', '适合带饭'],
        'warnings': [],
    },
    {
        'id': 'wheat025',
        'name': '三鲜水煎包',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '韭菜',
                'amount': '300克',
            },
            {
                'name': '猪绞肉',
                'amount': '200克',
            },
            {
                'name': '黑木耳',
                'amount': '1把',
            },
            {
                'name': '鸡蛋',
                'amount': '2颗',
            },
            {
                'name': '金钩海米',
                'amount': '1把',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '黑木耳泡发，去蒂切成末',
            '鸡蛋加盐打散，在锅里炒熟',
            '韭菜摘掉老叶，洗净控干，切成末',
            '金钩海米泡发切末',
            '猪绞肉里加海米末、盐半小勺、生抽一勺、蚝油一勺、胡椒粉半小勺腌入味，和韭菜、木耳、炒蛋、一勺油一起拌匀',
            '发酵好的面团放到案板上轻揉让它排气，切成大约 50 克左右的剂子',
            '把剂子擀成中间厚，边上薄的包子皮，每个皮中间放大约 50 克左右馅，一边提一边转捏出褶来包拢',
            '包好的包子放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅烧热，抹少量底油，下包子，煎到包子底部起壳',
            '倒入大约1厘米高的面粉水，加盖，转小火到面粉水收干关火',
            '略放一会儿等煎包的底部和锅底因为冷却速度不同自然脱离，整个锅翻过来，把包子倒扣盘子里',
        ],
        'comments': '不用面粉水直接用热水也可以，用鲜虾仁代替金钩海米调馅也可以',
        'utensil': '蒸锅',
        'category': '主食',
        'tags': ['省牙'],
        'warnings': [],
    },
    {
        'id': 'wheat026',
        'name': '烤羊肉包',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '胡萝卜',
                'amount': '半根',
            },
            {
                'name': '羊肉',
                'amount': '200克',
            },
            {
                'name': '洋葱',
                'amount': '半个',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母加温水搅拌均匀成酵母水',
            '面粉加酵母水拌匀，揉匀成团，发酵到原来的两倍大',
            '羊肉切细丁',
            '洋葱切碎',
            '胡萝卜擦丝',
            '烧热锅，放少许底油，下羊肉煸炒，等炒到出油，下一小勺辣椒粉、一小勺孜然粉炒香，加洋葱、胡萝卜炒软，加一勺盐，少量生抽调味成馅',
            '发酵好的面团放到案板上轻揉让它排气，切成大约 50 克左右的剂子',
            '把剂子擀成中间厚，边上薄的包子皮，每个皮中间放大约 50 克左右馅，将边上相对的四个点向中间捏起，再捏合四条脊，形成中间耸起的四角形',
            '包好的包子放在案板上二次发酵',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '烤箱预热好，170 度上下火烤 20 分钟左右',
            '羊肉油大，适合趁热吃',
        ],
        'comments': '',
        'utensil': '烤箱',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat027',
        'name': '猪肉糯米烧卖',
        'ingrds0': [
            {
                'name': '澄粉',
                'amount': '200克',
            },
            {
                'name': '玉米淀粉',
                'amount': '50克',
            },
            {
                'name': '开水',
                'amount': '320克',
            },
            {
                'name': '猪绞肉',
                'amount': '100克',
            },
            {
                'name': '糯米',
                'amount': '100克',
            },
            {
                'name': '干香菇',
                'amount': '20克',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 40,
        'prepSteps': [
            '糯米提前泡一夜，上笼蒸熟',
            '干香菇泡发，切细丁',
            '澄粉和玉米粉混合均匀后，加一勺油，一点点倒入开水，一边倒一边搅，确保所有的面都被烫熟',
            '等面稍微凉到不烫手后，揉成面团，饧 20 分钟左右',
            '猪绞肉里加生抽一勺、蚝油一勺、糖一勺、胡椒粉半小勺腌入味，和香菇粒、熟糯米一起拌匀成馅',
            '把面团移到案板上，揉到光滑，分成 10 克左右一个的剂子，像饺子皮一样擀成中间厚，边上薄',
            '面皮中间放上馅，捏拢成烧卖',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '上笼大火烧开，转中火蒸 5 分钟到皮半透明即可',
        ],
        'comments': '',
        'utensil': '蒸笼',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat028',
        'name': '鲜虾玉米烧卖',
        'ingrds0': [
            {
                'name': '澄粉',
                'amount': '200克',
            },
            {
                'name': '玉米淀粉',
                'amount': '50克',
            },
            {
                'name': '开水',
                'amount': '320克',
            },
            {
                'name': '猪绞肉',
                'amount': '100克',
            },
            {
                'name': '鲜虾',
                'amount': '100克',
            },
            {
                'name': '甜玉米',
                'amount': '1把',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
            {
                'name': '温水(40度左右)',
                'amount': '250克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 40,
        'prepSteps': [
            '澄粉和玉米粉混合均匀后，加一勺油，一点点倒入开水，一边倒一边搅，确保所有的面都被烫熟',
            '等面稍微凉到不烫手后，揉成面团，饧 20 分钟左右',
            '鲜虾剥壳去砂线，切成粒',
            '猪绞肉里加生抽一勺、蚝油一勺、糖一勺、胡椒粉半小勺腌入味，和虾粒、甜玉米粒一起拌匀成馅',
            '把面团移到案板上，揉到光滑，分成 10 克左右一个的剂子，像饺子皮一样擀成中间厚，边上薄',
            '面皮中间放上馅，捏拢成烧卖',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '上笼大火烧开，转中火蒸 5 分钟到皮半透明即可',
        ],
        'comments': '',
        'utensil': '蒸笼',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat029',
        'name': '玉米蛋松饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '350克',
            },
            {
                'name': '玉米粉',
                'amount': '150克',
            },
            {
                'name': '花生油',
                'amount': '80克',
            },
            {
                'name': '鸡蛋',
                'amount': '4个(约200克)',
            },
            {
                'name': '白糖',
                'amount': '125克',
            },
            {
                'name': '干酵母',
                'amount': '6克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 120,
        'prepSteps': [
            '干酵母用少量清水化开',
            '鸡蛋里加花生油、白糖，用筷子搅拌均匀',
            '面粉和玉米粉混合均匀，加入蛋液、酵母水和成面团',
            '面团放到温暖的地方发酵到两倍大',
            '把面团移到案板上，揉到光滑，分成 100 克左右一个的剂子，擀成 1 厘米左右厚的小饼，放在案板上二次发酵大约 20 分钟',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅里抹少量底油，放入小饼，文火烙到两面金黄',
        ],
        'comments': '用烤箱烤也可以，170 度上下火烤 15 分钟左右',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': ['高油', '高糖'],
    },
    {
        'id': 'wheat030',
        'name': '猪肉白菜馅饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '开水',
                'amount': '150克',
            },
            {
                'name': '室温水',
                'amount': '70克',
            },
            {
                'name': '油',
                'amount': '10克',
            },
            {
                'name': '猪肉馅',
                'amount': '200克',
            },
            {
                'name': '大白菜',
                'amount': '400克',
            },
            {
                'name': '金钩海米',
                'amount': '1把',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里慢慢倒入开水，一边倒一边搅成雪花状片，等放到室温，再加入油和室温水，和成面团，饧30分钟左右',
            '金钩海米泡发切末',
            '白菜切末，加盐腌一下，攥出多余的水分',
            '猪肉馅加半勺盐、一勺生抽、一勺蚝油、半勺胡椒粉、一勺白糖、一勺油、少量葱姜末腌入味，加白菜末拌匀',
            '把面团移到案板上，揉到光滑，分成 100 克左右一个的剂子，擀成直径 20 厘米左右的面皮',
            '面皮的一半放上馅抹平，把另一半对折过来，捏好边后把边往回规则地折成褶子',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅里抹少量底油，放入两张半圆的煎饼，文火烙到两面金黄',
            '对半切开成扇形食用',
        ],
        'comments': '白菜换成娃娃菜或者黄心菜也可以',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat031',
        'name': '猪肉莲藕馅饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '开水',
                'amount': '150克',
            },
            {
                'name': '室温水',
                'amount': '70克',
            },
            {
                'name': '油',
                'amount': '10克',
            },
            {
                'name': '猪肉馅',
                'amount': '200克',
            },
            {
                'name': '莲藕',
                'amount': '200克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里慢慢倒入开水，一边倒一边搅成雪花状片，等放到室温，再加入油和室温水，和成面团，饧30分钟左右',
            '莲藕切末',
            '猪肉馅加半勺盐、一勺生抽、一勺蚝油、半勺胡椒粉、一勺白糖、一勺油、少量葱姜末腌入味，加莲藕末拌匀',
            '把面团移到案板上，揉到光滑，分成 100 克左右一个的剂子，擀成直径 20 厘米左右的面皮',
            '面皮的一半放上馅抹平，把另一半对折过来，捏好边后把边往回规则地折成褶子',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅里抹少量底油，放入两张半圆的煎饼，文火烙到两面金黄',
            '对半切开成扇形食用',
        ],
        'comments': '莲藕换成芹菜也好吃',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat032',
        'name': '牛肉馅饼',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '400克',
            },
            {
                'name': '开水',
                'amount': '150克',
            },
            {
                'name': '室温水',
                'amount': '70克',
            },
            {
                'name': '油',
                'amount': '10克',
            },
            {
                'name': '牛肉馅',
                'amount': '200克',
            },
            {
                'name': '洋葱',
                'amount': '200克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里慢慢倒入开水，一边倒一边搅成雪花状片，等放到室温，再加入油和室温水，和成面团，饧30分钟左右',
            '洋葱切末',
            '热锅凉油，下牛肉馅和洋葱末翻炒到变色，加半勺盐、一勺生抽、半勺花椒粉、半勺黑胡椒粉调味',
            '把面团移到案板上，揉到光滑，擀成两张薄的长方形薄片',
            '抹上馅料，折两折或三折，再对折形成多层饼',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅里抹少量底油，放入牛肉饼，文火烙到两面金黄',
            '切开成条或块食用',
        ],
        'comments': '',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat033',
        'name': '褡裢火烧',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '200克',
            },
            {
                'name': '水',
                'amount': '120克',
            },
            {
                'name': '猪肉馅',
                'amount': '250克',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '小葱',
                'amount': '适量',
            },
        ],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里一边倒入水一边搅拌，和成面团，饧 30 分钟左右',
            '猪肉馅里加半勺盐、一勺熟酱、半勺黑胡椒粉、葱花、姜末、一勺香油调味',
            '把面团移到案板上，揉到光滑，分成20克左右的剂子',
            '把剂子搓成长条，擀成大约15厘米长，8厘米宽的长方面片',
            '在面片的一条长边抹上一条肉馅，然后卷成长条，收口的地方可以抹一点儿清水',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煎锅里抹少量底油，放入卷成长条的褡裢，文火烙到两面金黄',
            '出锅前撒香葱和少量白芝麻',
        ],
        'comments': '',
        'utensil': '煎锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat034',
        'name': '猪肉白菜饺子',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '水',
                'amount': '270克',
            },
            {
                'name': '猪肉馅',
                'amount': '200克',
            },
            {
                'name': '白菜',
                'amount': '400克',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '金钩海米',
                'amount': '1小把',
            },
        ],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里一边倒入水一边搅拌，和成面团，饧 30 分钟左右',
            '金钩海米泡发切末',
            '白菜切末，加盐腌一下，攥出多余的水分，加一勺油拌匀',
            '猪肉馅里加半勺盐、泡发金钩海米的水、半勺胡椒粉、葱花、姜末、一勺香油调味，加白菜末拌匀',
            '把面团移到案板上，揉到光滑，分成7克左右的剂子',
            '把剂子擀成大约直径8厘米，中间厚，边上薄的饺子皮，每个皮中间放大约7克馅，捏成饺子',
        ],
        'cookDurInMin': 10,
        'cookSteps': [
            '煮锅里烧开一大锅水，下饺子，大火转中火，到饺子都浮起来，皮半透明捞出，蘸醋碟食用',
        ],
        'comments': '',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat035',
        'name': '猪肉香菇黄心菜饺子',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '水',
                'amount': '270克',
            },
            {
                'name': '猪肉馅',
                'amount': '200克',
            },
            {
                'name': '黄心菜',
                'amount': '250克',
            },
            {
                'name': '香菇',
                'amount': '50克',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '金钩海米',
                'amount': '1小把',
            },
        ],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里一边倒入水一边搅拌，和成面团，饧 30 分钟左右',
            '金钩海米泡发切末',
            '黄心菜切末，香菇切末，加一勺油拌匀',
            '猪肉馅里加半勺盐、泡发金钩海米的水、半勺胡椒粉、葱花、姜末、一勺香油调味，加黄心菜和香菇末拌匀',
            '把面团移到案板上，揉到光滑，分成7克左右的剂子',
            '把剂子擀成大约直径8厘米，中间厚，边上薄的饺子皮，每个皮中间放大约7克馅，捏成饺子',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煮锅里烧开一大锅水，下饺子，大火转中火，到饺子都浮起来，皮半透明捞出，蘸醋碟食用',
        ],
        'comments': '',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat036',
        'name': '猪肉香芹木耳饺子',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '水',
                'amount': '270克',
            },
            {
                'name': '猪肉馅',
                'amount': '200克',
            },
            {
                'name': '香芹',
                'amount': '250克',
            },
            {
                'name': '鲜木耳',
                'amount': '50克',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
            {
                'name': '金钩海米',
                'amount': '1小把',
            },
        ],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里一边倒入水一边搅拌，和成面团，饧 30 分钟左右',
            '金钩海米泡发切末',
            '香芹洗净切末，木耳切末，加一勺油拌匀',
            '猪肉馅里加半勺盐、泡发金钩海米的水、半勺胡椒粉、葱花、姜末、一勺香油调味，加芹菜和木耳末拌匀',
            '把面团移到案板上，揉到光滑，分成7克左右的剂子',
            '把剂子擀成大约直径8厘米，中间厚，边上薄的饺子皮，每个皮中间放大约7克馅，捏成饺子',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煮锅里烧开一大锅水，下饺子，大火转中火，到饺子都浮起来，皮半透明捞出，蘸醋碟食用',
        ],
        'comments': '',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat037',
        'name': '韭菜鸡蛋饺子',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '水',
                'amount': '270克',
            },
            {
                'name': '鸡蛋',
                'amount': '4个(约200克)',
            },
            {
                'name': '韭菜',
                'amount': '300克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里一边倒入水一边搅拌，和成面团，饧 30 分钟左右',
            '韭菜洗净切末，加一勺油拌匀',
            '鸡蛋加盐打散，在锅里炒熟，和韭菜末一起，加一勺盐，一勺生抽调味拌匀成馅',
            '把面团移到案板上，揉到光滑，分成7克左右的剂子',
            '把剂子擀成大约直径8厘米，中间厚，边上薄的饺子皮，每个皮中间放大约7克馅，捏成饺子',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煮锅里烧开一大锅水，下饺子，大火转中火，到饺子都浮起来，皮半透明捞出，蘸醋碟食用',
        ],
        'comments': '韭菜容易熟，煮的时间可以比肉馅的饺子短一点儿',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat038',
        'name': '韭黄猪肉饺子',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '水',
                'amount': '270克',
            },
            {
                'name': '猪肉馅',
                'amount': '200克',
            },
            {
                'name': '韭黄',
                'amount': '300克',
            },
        ],
        'ingrds1': [],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里一边倒入水一边搅拌，和成面团，饧 30 分钟左右',
            '韭黄洗净切末，加一勺油拌匀',
            '猪肉馅里加半勺盐、半勺胡椒粉、一勺香油调味，加韭黄拌匀',
            '把面团移到案板上，揉到光滑，分成7克左右的剂子',
            '把剂子擀成大约直径8厘米，中间厚，边上薄的饺子皮，每个皮中间放大约7克馅，捏成饺子',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煮锅里烧开一大锅水，下饺子，大火转中火，到饺子都浮起来，皮半透明捞出，蘸醋碟食用',
        ],
        'comments': '',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
    {
        'id': 'wheat039',
        'name': '小白菜豆干饺子',
        'ingrds0': [
            {
                'name': '中筋粉',
                'amount': '500克',
            },
            {
                'name': '水',
                'amount': '270克',
            },
            {
                'name': '小白菜',
                'amount': '500克',
            },
            {
                'name': '豆腐干',
                'amount': '100克',
            },
        ],
        'ingrds1': [
            {
                'name': '大葱',
                'amount': '1段',
            },
        ],
        'prepDurInMin': 60,
        'prepSteps': [
            '面粉里一边倒入水一边搅拌，和成面团，饧 30 分钟左右',
            '小白菜洗净焯水，捞出来放凉，攥掉多余水分，加一勺香油拌匀',
            '豆腐干切末，和小白菜、葱花一起，加一勺盐，一勺蚝油、半勺白胡椒拌匀成馅',
            '把面团移到案板上，揉到光滑，分成7克左右的剂子',
            '把剂子擀成大约直径8厘米，中间厚，边上薄的饺子皮，每个皮中间放大约7克馅，捏成饺子',
        ],
        'cookDurInMin': 20,
        'cookSteps': [
            '煮锅里烧开一大锅水，下饺子，大火转中火，到饺子都浮起来，皮半透明捞出，蘸醋碟食用',
        ],
        'comments': '换成其他的应季青菜也可以，因为是素馅儿而且是熟的，煮的时间可以比肉馅的饺子短一点儿',
        'utensil': '煮锅',
        'category': '主食',
        'tags': [],
        'warnings': [],
    },
];
/*
煎饺
    豇豆
馄饨
    猪肉
    三鲜(虾仁、猪肉、香菇)
    荠菜
*/
